appendix.html

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">4. MODIFICATIONS</h3>
<div class="outline-text-3" id="text-3-5">


<p>
You may copy and distribute a Modified Version of the Document under the conditions of sections 2 and 3 above, provided that you release the Modified Version under precisely this License, with the Modified Version filling the role of the Document, thus licensing distribution and modification of the Modified Version to whoever possesses a copy of it. In addition, you must do these things in the Modified Version:
</p>
<p>
A. Use in the Title Page (and on the covers, if any) a title distinct from that of the Document, and from those of previous versions (which should, if there were any, be listed in the History section of the Document). You may use the same title as a previous version if the original publisher of that version gives permission. 
</p>
<p>
B. List on the Title Page, as authors, one or more persons or entities responsible for authorship of the modifications in the Modified Version, together with at least five of the principal authors of the Document (all of its principal authors, if it has fewer than five), unless they release you from this requirement. 
</p>
<p>
C. State on the Title page the name of the publisher of the Modified Version, as the publisher. 
</p>
<p>
D. Preserve all the copyright notices of the Document. 
</p>
<p>
E. Add an appropriate copyright notice for your modifications adjacent to the other copyright notices. 
</p>
<p>
F. Include, immediately after the copyright notices, a license notice giving the public permission to use the Modified Version under the terms of this License, in the form shown in the Addendum below.  
</p>
<p>
G. Preserve in that license notice the full lists of Invariant Sections and required Cover Texts given in the Document's license notice. 
</p>
<p>
H. Include an unaltered copy of this License. 
</p>
<p>
I. Preserve the section Entitled History, Preserve its Title, and add to it an item stating at least the title, year, new authors, and publisher of the Modified Version as given on the Title Page. If there is no section Entitled History in the Document, create one stating the title, year, authors, and publisher of the Document as given on its Title Page, then add an item describing the Modified Version as stated in the previous sentence. 
</p>
<p>
J. Preserve the network location, if any, given in the Document for public access to a Transparent copy of the Document, and likewise the network locations given in the Document for previous versions it was based on. These may be placed in the History section. You may omit a network location for a work that was published at least four years before the Document itself, or if the original publisher of the version it refers to gives permission. 
</p>
<p>
K. For any section Entitled Acknowledgements or Dedications, Preserve the Title of the section, and preserve in the section all the substance and tone of each of the contributor acknowledgements and/or dedications given therein. 
L. Preserve all the Invariant Sections of the Document, unaltered in their text and in their titles. Section numbers or the equivalent are not considered part of the section titles. 
</p>
<p>
M. Delete any section Entitled Endorsements. Such a section may not be included in the Modified Version. 
</p>
<p>
N. Do not retitle any existing section to be Entitled Endorsements or to conflict in title with any Invariant Section. 
</p>
<p>
O. Preserve any Warranty Disclaimers.
</p>
<p>
If the Modified Version includes new front-matter sections or appendices that qualify as Secondary Sections and contain no material copied from the Document, you may at your option designate some or all of these sections as invariant. To do this, add their titles to the list of Invariant Sections in the Modified Version's license notice. These titles must be distinct from any other section titles.
</p>
<p>
You may add a section Entitled Endorsements, provided it contains nothing but endorsements of your Modified Version by various parties&ndash;for example, statements of peer review or that the text has been approved by an organization as the authoritative definition of a standard.
</p>
<p>
You may add a passage of up to five words as a Front-Cover Text, and a passage of up to 25 words as a Back-Cover Text, to the end of the list of Cover Texts in the Modified Version. Only one passage of Front-Cover Text and one of Back-Cover Text may be added by (or through arrangements made by) any one entity. If the Document already includes a cover text for the same cover, previously added by you or by arrangement made by the same entity you are acting on behalf of, you may not add another; but you may replace the old one, on explicit permission from the previous publisher that added the old one.
</p>
<p>
The author(s) and publisher(s) of the Document do not by this License give permission to use their names for publicity for or to assert or imply endorsement of any Modified Version.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">5. COMBINING DOCUMENTS</h3>
<div class="outline-text-3" id="text-3-6">


<p>
You may combine the Document with other documents released under this License, under the terms defined in section 4 above for modified versions, provided that you include in the combination all of the Invariant Sections of all of the original documents, unmodified, and list them all as Invariant Sections of your combined work in its license notice, and that you preserve all their Warranty Disclaimers.
</p>
<p>
The combined work need only contain one copy of this License, and multiple identical Invariant Sections may be replaced with a single copy. If there are multiple Invariant Sections with the same name but different contents, make the title of each such section unique by adding at the end of it, in parentheses, the name of the original author or publisher of that section if known, or else a unique number. Make the same adjustment to the section titles in the list of Invariant Sections in the license notice of the combined work.
</p>
<p>
In the combination, you must combine any sections Entitled History in the various original documents, forming one section Entitled History;
likewise combine any sections Entitled Acknowledgements, and any sections Entitled Dedications. You must delete all sections Entitled Endorsements.
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">6. COLLECTIONS OF DOCUMENTS</h3>
<div class="outline-text-3" id="text-3-7">


<p>
You may make a collection consisting of the Document and other documents released under this License, and replace the individual copies of this License in the various documents with a single copy that is included in the collection, provided that you follow the rules of this License for verbatim copying of each of the documents in all other respects. 
</p>
<p>
You may extract a single document from such a collection, and distribute it individually under this License, provided you insert a copy of this License into the extracted document, and follow this License in all other respects regarding verbatim copying of that document.
</p>
</div>

</div>
