appendix.html

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">7. AGGREGATION WITH INDEPENDENT WORKS</h3>
<div class="outline-text-3" id="text-3-8">


<p>
A compilation of the Document or its derivatives with other separate and independent documents or works, in or on a volume of a storage or distribution medium, is called an aggregate if the copyright resulting from the compilation is not used to limit the legal rights of the compilation's users beyond what the individual works permit. When the Document is included in an aggregate, this License does not apply to the other works in the aggregate which are not themselves derivative works of the Document.
</p>
<p>
If the Cover Text requirement of section 3 is applicable to these copies of the Document, then if the Document is less than one half of the entire aggregate, the Document's Cover Texts may be placed on covers that bracket the Document within the aggregate, or the electronic equivalent of covers if the Document is in electronic form. Otherwise they must appear on printed covers that bracket the whole aggregate.
</p>
</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">8. TRANSLATION</h3>
<div class="outline-text-3" id="text-3-9">


<p>
Translation is considered a kind of modification, so you may distribute translations of the Document under the terms of section 4. Replacing Invariant Sections with translations requires special permission from their copyright holders, but you may include translations of some or all Invariant Sections in addition to the original versions of these Invariant Sections. You may include a translation of this License, and all the license notices in the Document, and any Warranty Disclaimers, provided that you also include the original English version of this License and the original versions of those notices and disclaimers. In case of a disagreement between the translation and the original version of this License or a notice or disclaimer, the original version will prevail.
</p>
<p>
If a section in the Document is Entitled Acknowledgements, Dedications, or History, the requirement (section 4) to Preserve its Title (section 1) will typically require changing the actual title.
</p>
</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">9. TERMINATION</h3>
<div class="outline-text-3" id="text-3-10">


<p>
You may not copy, modify, sublicense, or distribute the Document except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense, or distribute it is void, and will automatically terminate your rights under this License.
</p>
<p>
However, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.
</p>
<p>
Moreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice. 
</p>
<p>
Termination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License. If your rights have been terminated and not permanently reinstated, receipt of a copy of some or all of the same material does not give you any rights to use it.
</p>
</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11">10. FUTURE REVISIONS OF THIS LICENSE</h3>
<div class="outline-text-3" id="text-3-11">


<p>
The Free Software Foundation may publish new, revised versions of the GNU Free Documentation License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns. See <a href="http://www.gnu.org/copyleft/">http://www.gnu.org/copyleft/</a>.
</p>
<p>
Each version of the License is given a distinguishing version number. If the Document specifies that a particular numbered version of this License or any later version applies to it, you have the option of following the terms and conditions either of that specified version or of any later version that has been published (not as a draft) by the Free Software Foundation. If the Document does not specify a version number of this License, you may choose any version ever published (not as a draft) by the Free Software Foundation. If the Document specifies that a proxy can decide which future versions of this License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Document.
</p>
</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12">11. RELICENSING</h3>
<div class="outline-text-3" id="text-3-12">


<p>
Massive Multiauthor Collaboration Site (or MMC Site) means any World Wide Web server that publishes copyrightable works and also provides prominent facilities for anybody to edit those works. A public wiki that anybody can edit is an example of such a server. A Massive Multiauthor Collaboration (or MMC) contained in the site means any set of copyrightable works thus published on the MMC site.
</p>
<p>
CC-BY-SA means the Creative Commons Attribution-Share Alike 3.0 license published by Creative Commons Corporation, a not-for-profit corporation with a principal place of business in San Francisco, California, as well as future copyleft versions of that license published by that same organization.
</p>
<p>
Incorporate means to publish or republish a Document, in whole or in part, as part of another Document.
</p>
<p>
An MMC is eligible for relicensing if it is licensed under this License, and if all works that were first published under this License somewhere other than this MMC, and subsequently incorporated in whole or in part into the MMC, (1) had no cover texts or invariant sections, and (2) were thus incorporated prior to November 1, 2008.
</p>
<p>
The operator of an MMC Site may republish an MMC contained in the site under CC-BY-SA on the same site at any time before August 1, 2009, provided the MMC is eligible for relicensing.
</p>
</div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13">ADDENDUM: How to use this License for your documents</h3>
<div class="outline-text-3" id="text-3-13">


<p>
To use this License in a document you have written, include a copy of the License in the document and put the following copyright and license notices just after the title page: 
</p>
<blockquote>

<p>Copyright (c) YEAR YOUR NAME. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled GNU Free Documentation License.
</p>
</blockquote>


<p>
If you have Invariant Sections, Front-Cover Texts and Back-Cover Texts, replace the with&hellip;Texts. line with this:
</p>
<blockquote>

<p>with the Invariant Sections being LIST THEIR TITLES, with the Front-Cover Texts being LIST, and with the Back-Cover Texts being LIST.
</p>
</blockquote>


<p>
If you have Invariant Sections without Cover Texts, or some other combination of the three, merge those two alternatives to suit the situation.
</p>
<p>
If your document contains nontrivial examples of program code, we recommend releasing these examples in parallel under your choice of free software license, such as the GNU General Public License, to permit their use in free software. 
</p>
</div>
</div>

</div>
