appendix.org
* History
\label{cha:History}

| Title:     | Introduction to Probability and Statistics Using \textsf{R} |
| Year:      | 2011                                                        |
| Authors:   | G. Jay Kerns                                                |
| Publisher: | G. Jay Kerns                                                |

#+latex: \vfill{}

* Data
\label{cha:data}

This appendix is a reference of sorts regarding some of the data structures a statistician is likely to encounter. We discuss their salient features and idiosyncrasies.

** Data Structures \label{sec:Data-Structures}


*** Vectors

See the ``Vectors and Assignment'' section of /An Introduction to/ \textsf{R}. A vector is an ordered sequence of elements, such as numbers, characters, or logical values, and there may be =NA='s present. We usually make vectors with the assignment operator =<-=.

#+begin_src R :exports both :results output pp 
x <- c(3, 5, 9)
#+end_src

Vectors are atomic in the sense that if you try to mix and match elements of different modes then all elements will be coerced to the most convenient common mode.

#+begin_src R :exports both :results output pp 
y <- c(3, "5", TRUE)
#+end_src

In the example all elements were coerced to /character/ mode. We can test whether a given object is a vector with =is.vector= and can coerce an object (if possible) to a vector with =as.vector=.

*** Matrices and Arrays

See the ``Arrays and Matrices'' section of /An Introduction to/ \textsf{R}. Loosely speaking, a matrix is a vector that has been reshaped into rectangular form, and an array is a multidimensional matrix. Strictly speaking, it is the other way around: an array is a data vector with a dimension attribute (=dim=), and a matrix is the special case of an array with only two dimensions. We can construct a matrix with the =matrix= function. 

#+begin_src R :exports both :results output pp 
matrix(letters[1:6], nrow = 2, ncol = 3)
#+end_src

Notice the order of the matrix entries, which shows how the matrix is populated by default. We can change this with the =byrow= argument:

#+begin_src R :exports both :results output pp 
matrix(letters[1:6], nrow = 2, ncol = 3, byrow = TRUE)
#+end_src

We can test whether a given object is a matrix with =is.matrix= and can coerce an object (if possible) to a matrix with =as.matrix=. As a final example watch what happens when we mix and match types in the first argument:

#+begin_src R :exports both :results output pp 
matrix(c(1,"2",NA, FALSE), nrow = 2, ncol = 3)
#+end_src

Notice how all of the entries were coerced to character for the final result (except =NA=). Also notice how the four values were /recycled/ to fill up the six entries of the matrix.

The standard arithmetic operations work element-wise with matrices.

#+begin_src R :exports both :results output pp 
A <- matrix(1:6, 2, 3)
B <- matrix(2:7, 2, 3)
A + B
A * B
#+end_src

If you want the standard definition of matrix multiplication then use the =%*%= function. If we were to try =A %*% B= we would get an error because the dimensions do not match correctly, but for fun, we could transpose =B= to get conformable matrices. The transpose function =t= only works for matrices (and data frames).

#+begin_src R :exports both :results output pp 
try(A * B)     # an error
A %*% t(B)     # this is alright
#+end_src

To get the ordinary matrix inverse use the =solve= function: 

#+begin_src R :exports both :results output pp 
solve(A %*% t(B))     # input matrix must be square
#+end_src

Arrays more general than matrices, and some functions (like transpose) do not work for the more general array. Here is what an array looks like: 

#+begin_src R :exports both :results output pp 
array(LETTERS[1:24], dim = c(3,4,2))
#+end_src

We can test with =is.array= and may coerce with =as.array=.

*** Data Frames

A data frame is a rectangular array of information with a special status in \textsf{R}. It is used as the fundamental data structure by many of the modeling functions. It is like a matrix in that all of the columns must be the same length, but it is more general than a matrix in that columns are allowed to have different modes.

#+begin_src R :exports both :results output pp 
x <- c(1.3, 5.2, 6)
y <- letters[1:3]
z <- c(TRUE, FALSE, TRUE)
A <- data.frame(x, y, z)
A
#+end_src

Notice the =names= on the columns of =A=. We can change those with the =names= function.

#+begin_src R :exports both :results output pp 
names(A) <- c("Fred","Mary","Sue")
A
#+end_src

Basic command is =data.frame=. You can test with =is.data.frame= and you can coerce with =as.data.frame=.


*** Lists
A list is more general than a data frame.

