appendix.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">History</h2>
<div class="outline-text-2" id="text-4">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Title:</td><td class="left">Introduction to Probability and Statistics Using \(\mathsf{R}\), Second Edition</td></tr>
<tr><td class="left">Year:</td><td class="left">2011</td></tr>
<tr><td class="left">Authors:</td><td class="left">G. Jay Kerns</td></tr>
<tr><td class="left">Publisher:</td><td class="left">G. Jay Kerns</td></tr>
</tbody>
</table>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Title:</td><td class="left">Introduction to Probability and Statistics Using \(\mathsf{R}\), First Edition</td></tr>
<tr><td class="left">Year:</td><td class="left">2010</td></tr>
<tr><td class="left">Authors:</td><td class="left">G. Jay Kerns</td></tr>
<tr><td class="left">Publisher:</td><td class="left">G. Jay Kerns</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Data</h2>
<div class="outline-text-2" id="text-5">


<p>
This appendix is a reference of sorts regarding some of the data structures a statistician is likely to encounter. We discuss their salient features and idiosyncrasies.
</p>

</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Data Structures</h3>
<div class="outline-text-3" id="text-5-1">




</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">Vectors</h4>
<div class="outline-text-4" id="text-5-1-1">


<p>
See the ``Vectors and Assignment'' section of <i>An Introduction to</i> \(\mathsf{R}\). A vector is an ordered sequence of elements, such as numbers, characters, or logical values, and there may be <code>NA</code>'s present. We usually make vectors with the assignment operator <code>&lt;-</code>.
</p>



<pre class="src src-R">x <span style="color: #008b8b;">&lt;-</span> c(3, 5, 9)
</pre>



<p>
Vectors are atomic in the sense that if you try to mix and match elements of different modes then all elements will be coerced to the most convenient common mode.
</p>



<pre class="src src-R">y <span style="color: #008b8b;">&lt;-</span> c(3, <span style="color: #8b2252;">"5"</span>, <span style="color: #228b22;">TRUE</span>)
</pre>



<p>
In the example all elements were coerced to <i>character</i> mode. We can test whether a given object is a vector with <code>is.vector</code> and can coerce an object (if possible) to a vector with <code>as.vector</code>.
</p>
</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">Matrices and Arrays</h4>
<div class="outline-text-4" id="text-5-1-2">


<p>
See the ``Arrays and Matrices'' section of <i>An Introduction to</i> \(\mathsf{R}\). Loosely speaking, a matrix is a vector that has been reshaped into rectangular form, and an array is a multidimensional matrix. Strictly speaking, it is the other way around: an array is a data vector with a dimension attribute (<code>dim</code>), and a matrix is the special case of an array with only two dimensions. We can construct a matrix with the <code>matrix</code> function. 
</p>



<pre class="src src-R">matrix(letters[1:6], nrow = 2, ncol = 3)
</pre>


<pre class="example">
     [,1] [,2] [,3]
[1,] "a"  "c"  "e" 
[2,] "b"  "d"  "f"
</pre>


<p>
Notice the order of the matrix entries, which shows how the matrix is populated by default. We can change this with the <code>byrow</code> argument:
</p>



<pre class="src src-R">matrix(letters[1:6], nrow = 2, ncol = 3, byrow = <span style="color: #228b22;">TRUE</span>)
</pre>


<pre class="example">
     [,1] [,2] [,3]
[1,] "a"  "b"  "c" 
[2,] "d"  "e"  "f"
</pre>


<p>
We can test whether a given object is a matrix with <code>is.matrix</code> and can coerce an object (if possible) to a matrix with <code>as.matrix</code>. As a final example watch what happens when we mix and match types in the first argument:
</p>



<pre class="src src-R">matrix(c(1,<span style="color: #8b2252;">"2"</span>,<span style="color: #228b22;">NA</span>, <span style="color: #228b22;">FALSE</span>), nrow = 2, ncol = 3)
</pre>


<pre class="example">
     [,1] [,2]    [,3]
[1,] "1"  NA      "1" 
[2,] "2"  "FALSE" "2"
</pre>


<p>
Notice how all of the entries were coerced to character for the final result (except <code>NA</code>). Also notice how the four values were <i>recycled</i> to fill up the six entries of the matrix.
</p>
<p>
The standard arithmetic operations work element-wise with matrices.
</p>



<pre class="src src-R">A <span style="color: #008b8b;">&lt;-</span> matrix(1:6, 2, 3)
B <span style="color: #008b8b;">&lt;-</span> matrix(2:7, 2, 3)
A + B
A * B
</pre>


<pre class="example">
     [,1] [,2] [,3]
[1,]    3    7   11
[2,]    5    9   13
     [,1] [,2] [,3]
[1,]    2   12   30
[2,]    6   20   42
</pre>


<p>
If you want the standard definition of matrix multiplication then use the <code>%*%</code> function. If we were to try <code>A %*% B</code> we would get an error because the dimensions do not match correctly, but for fun, we could transpose <code>B</code> to get conformable matrices. The transpose function <code>t</code> only works for matrices (and data frames).
</p>



<pre class="src src-R">try(A * B)     <span style="color: #b22222;"># </span><span style="color: #b22222;">an error</span>
A %*% t(B)     <span style="color: #b22222;"># </span><span style="color: #b22222;">this is alright</span>
</pre>


<pre class="example">
     [,1] [,2] [,3]
[1,]    2   12   30
[2,]    6   20   42
     [,1] [,2]
[1,]   44   53
[2,]   56   68
</pre>


<p>
To get the ordinary matrix inverse use the <code>solve</code> function: 
</p>



<pre class="src src-R">solve(A %*% t(B))     <span style="color: #b22222;"># </span><span style="color: #b22222;">input matrix must be square</span>
</pre>


<pre class="example">
          [,1]      [,2]
[1,]  2.833333 -2.208333
[2,] -2.333333  1.833333
</pre>


<p>
Arrays more general than matrices, and some functions (like transpose) do not work for the more general array. Here is what an array looks like: 
</p>



<pre class="src src-R">array(LETTERS[1:24], dim = c(3,4,2))
</pre>



<pre class="example">, , 1

     [,1] [,2] [,3] [,4]
[1,] "A"  "D"  "G"  "J" 
[2,] "B"  "E"  "H"  "K" 
[3,] "C"  "F"  "I"  "L" 

, , 2

     [,1] [,2] [,3] [,4]
[1,] "M"  "P"  "S"  "V" 
[2,] "N"  "Q"  "T"  "W" 
[3,] "O"  "R"  "U"  "X"
</pre>


<p>
We can test with <code>is.array</code> and may coerce with <code>as.array</code>.
</p>
</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">Data Frames</h4>
<div class="outline-text-4" id="text-5-1-3">


<p>
A data frame is a rectangular array of information with a special status in \(\mathsf{R}\). It is used as the fundamental data structure by many of the modeling functions. It is like a matrix in that all of the columns must be the same length, but it is more general than a matrix in that columns are allowed to have different modes.
</p>



<pre class="src src-R">x <span style="color: #008b8b;">&lt;-</span> c(1.3, 5.2, 6)
y <span style="color: #008b8b;">&lt;-</span> letters[1:3]
z <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #228b22;">TRUE</span>, <span style="color: #228b22;">FALSE</span>, <span style="color: #228b22;">TRUE</span>)
A <span style="color: #008b8b;">&lt;-</span> data.frame(x, y, z)
A
</pre>


<pre class="example">
    x y     z
1 1.3 a  TRUE
2 5.2 b FALSE
3 6.0 c  TRUE
</pre>


<p>
Notice the <code>names</code> on the columns of <code>A</code>. We can change those with the <code>names</code> function.
</p>



<pre class="src src-R">names(A) <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">"Fred"</span>,<span style="color: #8b2252;">"Mary"</span>,<span style="color: #8b2252;">"Sue"</span>)
A
</pre>


<pre class="example">
  Fred Mary   Sue
1  1.3    a  TRUE
2  5.2    b FALSE
3  6.0    c  TRUE
</pre>


<p>
Basic command is <code>data.frame</code>. You can test with <code>is.data.frame</code> and you can coerce with <code>as.data.frame</code>.
</p>

</div>

</div>

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">Lists</h4>
<div class="outline-text-4" id="text-5-1-4">

<p>A list is more general than a data frame.
</p>
</div>

</div>
