appendix.org
*** Tables
The word ``table'' has a special meaning in \textsf{R}. More precisely, a contingency table is an object of class =table= which is an array.

Suppose you have a contingency table and would like to do descriptive or inferential statistics on it. The default form of the table is usually inconvenient to use unless we are working with a function specially tailored for tables. Here is how to transform your data to a more manageable form, namely, the raw data used to make the table.

First, we coerce the table to a data frame with: 

#+begin_src R :exports both :results output pp 
A <- as.data.frame(Titanic)
head(A)
#+end_src

Note that there are as many preliminary columns of =A= as there are dimensions to the table. The rows of =A= contain every possible combination of levels from each of the dimensions. There is also a =Freq= column, which shows how many observations there were at that particular combination of levels. 

The form of =A= is often sufficient for our purposes, but more often we need to do more work: we would usually like to repeat each row of =A= exactly the number of times shown in the =Freq= column. The =reshape= package \cite{Wickhamreshape} has the function =untable= designed for that very purpose: 

#+begin_src R :exports both :results output pp 
library(reshape)
B <- with(A, untable(A, Freq))
head(B)
#+end_src

Now, this is more like it. Note that we slipped in a call to the =with= function, which was done to make the call to =untable= more pretty; we could just as easily have done
:  untable(TitanicDF, A$Freq)


The only fly in the ointment is the lingering =Freq= column which has repeated values that do not have any meaning any more. We could just ignore it, but it would be better to get rid of the meaningless column so that it does not cause trouble later. While we are at it, we could clean up the =rownames=, too.

#+begin_src R :exports both :results output pp 
C <- B[, -5]
rownames(C) <- 1:dim(C)[1]
head(C)
#+end_src


*** More about Tables
Suppose you want to make a table that looks like this:

There are at least two ways to do it.

- Using a matrix:
  #+begin_src R :exports both :results output pp 
  tab <- matrix(1:6, nrow = 2, ncol = 3)
  rownames(tab) <- c('first', 'second')
  colnames(tab) <- c('A', 'B', 'C')
  tab  # Counts
  #+end_src
   - note that the columns are filled in consecutively by default. If you want to fill the data in by rows then do =byrow = TRUE= in the =matrix= command.

- Using a dataframe
  #+begin_src R :exports both :results output pp 
  p <- c("milk","tea")
  g <- c("milk","tea")
  catgs <- expand.grid(poured = p, guessed = g)
  cnts <- c(3, 1, 1, 3)
  D <- cbind(catgs, count = cnts)
  xtabs(count ~ poured + guessed, data = D)
  #+end_src
   - again, the data are filled in column-wise.
   - the object is a dataframe
   - if you want to store it as a table then do =A <- xtabs(count ~ poured + guessed, data = D)=


** Importing Data \label{sec:Importing-A-Data}

Statistics is the study of data, so the statistician's first step is usually to obtain data from somewhere or another and read them into \textsf{R}. In this section we describe some of the most common sources of data and how to get data from those sources into a running \textsf{R} session.

For more information please refer to the \textsf{R} /Data Import/Export Manual/, \cite{rstatenv} and /An Introduction to/ \textsf{R}, \cite{Venables2010}.

*** Data in Packages

There are many data sets stored in the =datasets= package of base \textsf{R}. To see a list of them all issue the command =data(package = "datasets")=. The output is omitted here because the list is so long. The names of the data sets are listed in the left column. Any data set in that list is already on the search path by default, which means that a user can use it immediately without any additional work. 

There are many other data sets available in the thousands of contributed packages. To see the data sets available in those packages that are currently loaded into memory issue the single command =data()=. If you would like to see all of the data sets that are available in all packages that are installed on your computer (but not necessarily loaded), issue the command 

:  data(package = .packages(all.available = TRUE))

To load the data set =foo= in the contributed package =bar= issue the commands =library(bar)= followed by =data(foo)=, or just the single command  

:  data(foo, package = "bar")

*** Text Files
Many sources of data are simple text files. The entries in the file are separated by delimeters such as TABS (tab-delimeted), commas (comma separated values, or =.csv=, for short) or even just white space (no special name). A lot of data on the Internet are stored with text files, and even if they are not, a person can copy-paste information from a web page to a text file, save it on the computer, and read it into \textsf{R}. 

*** Other Software Files
Often the data set of interest is stored in some other, proprietary, format by third-party software such as Minitab, SAS, or SPSS. The =foreign= package supports import/conversion from many of these formats. Please note, however, that data sets from other software sometimes have properties with no direct analogue in \textsf{R}. In those cases the conversion process may lose some information which will need to be reentered manually from within \textsf{R}. See the /Data Import/Export Manual/.

As an example, suppose the data are stored in the SPSS file =foo.sav= which the user has copied to the working directory; it can be imported with the commands

#+begin_src R :exports code :eval never
library(foreign)
read.spss("foo.sav")
#+end_src

See =?read.spss= for the available options to customize the file import. Note that the \textsf{R} Commander will import many of the common file types with a menu driven interface.

*** Importing a Data Frame

The basic command is =read.table=.

** Creating New Data Sets \label{sec:Creating-New-Data}
Using =c=
Using =scan=
Using the \textsf{R} Commander.

** Editing Data \label{sec:Editing-Data-Sets}
*** Editing Data Values
