appendix.html

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5">Tables</h4>
<div class="outline-text-4" id="text-5-1-5">

<p>The word ``table'' has a special meaning in \(\mathsf{R}\). More precisely, a contingency table is an object of class <code>table</code> which is an array.
</p>
<p>
Suppose you have a contingency table and would like to do descriptive or inferential statistics on it. The default form of the table is usually inconvenient to use unless we are working with a function specially tailored for tables. Here is how to transform your data to a more manageable form, namely, the raw data used to make the table.
</p>
<p>
First, we coerce the table to a data frame with: 
</p>



<pre class="src src-R">A <span style="color: #008b8b;">&lt;-</span> as.data.frame(Titanic)
head(A)
</pre>


<pre class="example">
  Class    Sex   Age Survived Freq
1   1st   Male Child       No    0
2   2nd   Male Child       No    0
3   3rd   Male Child       No   35
4  Crew   Male Child       No    0
5   1st Female Child       No    0
6   2nd Female Child       No    0
</pre>


<p>
Note that there are as many preliminary columns of <code>A</code> as there are dimensions to the table. The rows of <code>A</code> contain every possible combination of levels from each of the dimensions. There is also a <code>Freq</code> column, which shows how many observations there were at that particular combination of levels. 
</p>
<p>
The form of <code>A</code> is often sufficient for our purposes, but more often we need to do more work: we would usually like to repeat each row of <code>A</code> exactly the number of times shown in the <code>Freq</code> column. The <code>reshape</code> package \cite{Wickhamreshape} has the function <code>untable</code> designed for that very purpose: 
</p>



<pre class="src src-R"><span style="color: #008b8b;">library</span>(reshape)
B <span style="color: #008b8b;">&lt;-</span> with(A, untable(A, Freq))
head(B)
</pre>


<pre class="example">
    Class  Sex   Age Survived Freq
3     3rd Male Child       No   35
3.1   3rd Male Child       No   35
3.2   3rd Male Child       No   35
3.3   3rd Male Child       No   35
3.4   3rd Male Child       No   35
3.5   3rd Male Child       No   35
</pre>


<p>
Now, this is more like it. Note that we slipped in a call to the <code>with</code> function, which was done to make the call to <code>untable</code> more pretty; we could just as easily have done
</p><pre class="example">
 untable(TitanicDF, A$Freq)
</pre>



<p>
The only fly in the ointment is the lingering <code>Freq</code> column which has repeated values that do not have any meaning any more. We could just ignore it, but it would be better to get rid of the meaningless column so that it does not cause trouble later. While we are at it, we could clean up the <code>rownames</code>, too.
</p>



<pre class="src src-R">C <span style="color: #008b8b;">&lt;-</span> B[, -5]
rownames(C) <span style="color: #008b8b;">&lt;-</span> 1:dim(C)[1]
head(C)
</pre>


<pre class="example">
  Class  Sex   Age Survived
1   3rd Male Child       No
2   3rd Male Child       No
3   3rd Male Child       No
4   3rd Male Child       No
5   3rd Male Child       No
6   3rd Male Child       No
</pre>



</div>

</div>

<div id="outline-container-5-1-6" class="outline-4">
<h4 id="sec-5-1-6">More about Tables</h4>
<div class="outline-text-4" id="text-5-1-6">

<p>Suppose you want to make a table that looks like this:
</p>
<p>
There are at least two ways to do it.
</p>
<ul>
<li>Using a matrix:
</li>
</ul>




<pre class="src src-R">  tab <span style="color: #008b8b;">&lt;-</span> matrix(1:6, nrow = 2, ncol = 3)
  rownames(tab) <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">'first'</span>, <span style="color: #8b2252;">'second'</span>)
  colnames(tab) <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">'A'</span>, <span style="color: #8b2252;">'B'</span>, <span style="color: #8b2252;">'C'</span>)
  tab  <span style="color: #b22222;"># </span><span style="color: #b22222;">Counts</span>
</pre>


<pre class="example">
       A B C
first  1 3 5
second 2 4 6
</pre>


<ul>
<li>note that the columns are filled in consecutively by default. If you want to fill the data in by rows then do <code>byrow = TRUE</code> in the <code>matrix</code> command.

</li>
<li>Using a dataframe
</li>
</ul>




<pre class="src src-R">  p <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">"milk"</span>,<span style="color: #8b2252;">"tea"</span>)
  g <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">"milk"</span>,<span style="color: #8b2252;">"tea"</span>)
  catgs <span style="color: #008b8b;">&lt;-</span> expand.grid(poured = p, guessed = g)
  cnts <span style="color: #008b8b;">&lt;-</span> c(3, 1, 1, 3)
  D <span style="color: #008b8b;">&lt;-</span> cbind(catgs, count = cnts)
  xtabs(count ~ poured + guessed, data = D)
</pre>


<pre class="example">
      guessed
poured milk tea
  milk    3   1
  tea     1   3
</pre>


<ul>
<li>again, the data are filled in column-wise.
</li>
<li>the object is a dataframe
</li>
<li>if you want to store it as a table then do <code>A &lt;- xtabs(count ~ poured + guessed, data = D)</code>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Importing Data</h3>
<div class="outline-text-3" id="text-5-2">


<p>
Statistics is the study of data, so the statistician's first step is usually to obtain data from somewhere or another and read them into \(\mathsf{R}\). In this section we describe some of the most common sources of data and how to get data from those sources into a running \(\mathsf{R}\) session.
</p>
<p>
For more information please refer to the \(\mathsf{R}\) <i>Data Import/Export Manual</i>, \cite{rstatenv} and <i>An Introduction to</i> \(\mathsf{R}\), \cite{Venables2010}.
</p>

</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">Data in Packages</h4>
<div class="outline-text-4" id="text-5-2-1">


<p>
There are many data sets stored in the <code>datasets</code> package of base \(\mathsf{R}\). To see a list of them all issue the command <code>data(package = "datasets")</code>. The output is omitted here because the list is so long. The names of the data sets are listed in the left column. Any data set in that list is already on the search path by default, which means that a user can use it immediately without any additional work. 
</p>
<p>
There are many other data sets available in the thousands of contributed packages. To see the data sets available in those packages that are currently loaded into memory issue the single command <code>data()</code>. If you would like to see all of the data sets that are available in all packages that are installed on your computer (but not necessarily loaded), issue the command 
</p>
<pre class="example">
 data(package = .packages(all.available = TRUE))
</pre>


<p>
To load the data set <code>foo</code> in the contributed package <code>bar</code> issue the commands <code>library(bar)</code> followed by <code>data(foo)</code>, or just the single command  
</p>
<pre class="example">
 data(foo, package = "bar")
</pre>


</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">Text Files</h4>
<div class="outline-text-4" id="text-5-2-2">

<p>Many sources of data are simple text files. The entries in the file are separated by delimeters such as TABS (tab-delimeted), commas (comma separated values, or <code>.csv</code>, for short) or even just white space (no special name). A lot of data on the Internet are stored with text files, and even if they are not, a person can copy-paste information from a web page to a text file, save it on the computer, and read it into \(\mathsf{R}\). 
</p>
</div>

</div>

<div id="outline-container-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">Other Software Files</h4>
<div class="outline-text-4" id="text-5-2-3">

<p>Often the data set of interest is stored in some other, proprietary, format by third-party software such as Minitab, SAS, or SPSS. The <code>foreign</code> package supports import/conversion from many of these formats. Please note, however, that data sets from other software sometimes have properties with no direct analogue in \(\mathsf{R}\). In those cases the conversion process may lose some information which will need to be reentered manually from within \(\mathsf{R}\). See the <i>Data Import/Export Manual</i>.
</p>
<p>
As an example, suppose the data are stored in the SPSS file <code>foo.sav</code> which the user has copied to the working directory; it can be imported with the commands
</p>



<pre class="src src-R"><span style="color: #008b8b;">library</span>(foreign)
read.spss(<span style="color: #8b2252;">"foo.sav"</span>)
</pre>


<p>
See <code>?read.spss</code> for the available options to customize the file import. Note that the \(\mathsf{R}\) Commander will import many of the common file types with a menu driven interface.
</p>
</div>

</div>

<div id="outline-container-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">Importing a Data Frame</h4>
<div class="outline-text-4" id="text-5-2-4">


<p>
The basic command is <code>read.table</code>.
</p>
</div>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Creating New Data Sets</h3>
<div class="outline-text-3" id="text-5-3">

<p>Using <code>c</code>
Using <code>scan</code>
Using the \(\mathsf{R}\) Commander.
</p>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4">Editing Data</h3>
<div class="outline-text-3" id="text-5-4">


</div>

<div id="outline-container-5-4-1" class="outline-4">
<h4 id="sec-5-4-1">Editing Data Values</h4>
<div class="outline-text-4" id="text-5-4-1">

</div>

</div>
