appendix.org
*** Inserting Rows and Columns
*** Deleting Rows and Columns
*** Sorting Data

We can sort a vector with the =sort= function. Normally we have a data frame of several columns (variables) and many, many rows (observations). The goal is to shuffle the rows so that they are ordered by the values of one or more columns. This is done with the =order= function. 

For example, we may sort all of the rows of the =Puromycin= data (in ascending order) by the variable =conc= with the following: 

#+begin_src R :exports both :results output pp 
Tmp <- Puromycin[order(Puromycin$conc), ]
head(Tmp)
#+end_src

We can accomplish the same thing with the command 

#+begin_src R :exports code :eval never
with(Puromycin, Puromycin[order(conc), ])
#+end_src

We can sort by more than one variable. To sort first by =state= and next by =conc= do 

#+begin_src R :exports code :eval never
with(Puromycin, Puromycin[order(state, conc), ])
#+end_src

If we would like to sort a numeric variable in descending order then we put a minus sign in front of it. 

#+begin_src R :exports both :results output pp 
Tmp <- with(Puromycin, Puromycin[order(-conc), ])
head(Tmp)
#+end_src

If we would like to sort by a character (or factor) in decreasing order then we can use the =xtfrm= function which produces a numeric vector in the same order as the character vector.

#+begin_src R :exports both :results output pp 
Tmp <- with(Puromycin, Puromycin[order(-xtfrm(state)), ])
head(Tmp)
#+end_src

** Exporting Data \label{sec:Exporting-a-Data}

The basic function is =write.table=. The =MASS= package also has a =write.matrix= function.

** Reshaping Data \label{sec:Reshaping-a-Data}
- Aggregation
- Convert Tables to data frames and back

=rbind=, =cbind=
=ab[order(ab[,1]),]=
=complete.cases=
=aggregate=
=stack=

* Mathematical Machinery
\label{cha:Mathematical-Machinery}

This appendix houses many of the standard definitions and theorems that are used at some point during the narrative. It is targeted for someone reading the book who forgets the precise definition of something and would like a quick reminder of an exact statement. No proofs are given, and the interested reader should consult a good text on Calculus (say, Stewart \cite{Stewart2008} or Apostol \cite{Apostol1967,ApostolI1967}), Linear Algebra (say, Strang \cite{Strang1988} and Magnus \cite{Magnus1999}), Real Analysis (say, Folland \cite{Folland1999}, or Carothers \cite{Carothers2000}), or Measure Theory (Billingsley \cite{Billingsley1995}, Ash \cite{Ash2000}, Resnick \cite{Resnick1999}) for details. 


** Set Algebra \label{sec:The-Algebra-of}

We denote sets by capital letters, \(A\), \(B\), \(C\), /etc/. The letter \(S\) is reserved for the sample space, also known as the universe or universal set, the set which contains all possible elements. The symbol \(\emptyset\) represents the empty set, the set with no elements. 


*** Set Union, Intersection, and Difference

Given subsets \(A\) and \(B\), we may manipulate them in an algebraic fashion. To this end, we have three set operations at our disposal: union, intersection, and difference. Below is a table summarizing the pertinent information about these operations.

#+CAPTION: [Set operations]{Set operations.}
#+LABEL: tab:Set-Operations
| Name         | Denoted             | Defined by elements   | \textsf{R} syntax |
|--------------+---------------------+-----------------------+-------------------|
| Union        | \(A\cup B\)           | in \(A\) or \(B\) or both | =union(A, B)=     |
| Intersection | \(A\cap B\)           | in both \(A\) and \(B\)   | =intersect(A, B)= |
| Difference   | \(A\textbackslash B\) | in \(A\) but not in \(B\) | =setdiff(A, B)=   |
| Complement   | \(A^{c}\)             | in \(S\) but not in \(A\) | =setdiff(S, A)=   |



*** Identities and Properties

1. \(A\cup\emptyset=A,\quad A\cap\emptyset=\emptyset\)
1. \(A\cup S=S,\quad A\cap S=A\)
1. \(A\cup A^{c}=S\), \(A\cap A^{c}=\emptyset\)
1. \((A{}^{c})^{c}=A\)
1. The Commutative Property: 
   \begin{equation}
   A \cup B = B\cup A,\quad A\cap B = B\cap A
   \end{equation}
1. The Associative Property: 
   \begin{equation}
   (A\cup B)\cup C=A\cup(B\cup C),\quad(A\cap B)\cap C=A\cap(B\cap C)
   \end{equation}
1. The Distributive Property: 
   \begin{equation}
   A\cup(B\cap C)=(A\cup B)\cap(A\cup B),\quad A\cap(B\cup C)=(A\cap B)\cup(A\cap B)
   \end{equation}
1. DeMorgan's Laws
   \begin{equation}
   (A\cup B)^{c}=A^{c}\cap B^{c}\quad\mbox{and}\quad(A\cap B)^{c}=A^{c}\cup B^{c},
   \end{equation}
   or more generally,
   \begin{equation}
   \left(\bigcup_{\alpha}A_{\alpha}\right)^{c}=\bigcap_{\alpha}A_{\alpha}^{c},\quad\mbox{and}\quad\left(\bigcap_{\alpha}A_{\alpha}\right)^{c}=\bigcup_{\alpha}A_{\alpha}^{c}
   \end{equation}

** Differential and Integral Calculus \label{sec:Differential-and-Integral}

A function \(f\) of one variable is said to be one-to-one if no two distinct \(x\) values are mapped to the same \(y=f(x)\) value. To show that a function is one-to-one we can either use the horizontal line test or we may start with the equation \(f(x_{1}) = f(x_{2})\) and use algebra to show that it implies \(x_{1} = x_{2}\).

*** Limits and Continuity
#+latex: \begin{defn}
Let \(f\) be a function defined on some open interval that contains the number \(a\), except possibly at \(a\) itself. Then we say the /limit of/ \(f(x)\) /as/ \(x\) /approaches/ \(a\) /is/ \(L\), and we write 
\begin{equation}
\lim_{x \to a}f(x) = L,
\end{equation}
if for every \(\epsilon > 0\) there exists a number \(\delta > 0\) such that \(0 < |x-a| < \delta\) implies \(|f(x) - L| < \epsilon\).
#+latex: \end{defn}

#+latex: \begin{defn}
A function \(f\) is /continuous at a number/ \(a\) if 
\begin{equation}
\lim_{x \to a} f(x) = f(a).
\end{equation}
The function \(f\) is /right-continuous at the number/ \(a\) if \(\lim_{x\to a^{+}}f(x)=f(a)\), and /left-continuous/ at \(a\) if \(\lim_{x\to a^{-}}f(x)=f(a)\). Finally, the function \(f\) is /continuous on an interval/ \(I\) if it is continuous at every number in the interval. 
#+latex: \end{defn}

