appendix.html

<div id="outline-container-5-4-2" class="outline-4">
<h4 id="sec-5-4-2">Inserting Rows and Columns</h4>
<div class="outline-text-4" id="text-5-4-2">

</div>

</div>

<div id="outline-container-5-4-3" class="outline-4">
<h4 id="sec-5-4-3">Deleting Rows and Columns</h4>
<div class="outline-text-4" id="text-5-4-3">

</div>

</div>

<div id="outline-container-5-4-4" class="outline-4">
<h4 id="sec-5-4-4">Sorting Data</h4>
<div class="outline-text-4" id="text-5-4-4">


<p>
We can sort a vector with the <code>sort</code> function. Normally we have a data frame of several columns (variables) and many, many rows (observations). The goal is to shuffle the rows so that they are ordered by the values of one or more columns. This is done with the <code>order</code> function. 
</p>
<p>
For example, we may sort all of the rows of the <code>Puromycin</code> data (in ascending order) by the variable <code>conc</code> with the following: 
</p>



<pre class="src src-R">Tmp <span style="color: #008b8b;">&lt;-</span> Puromycin[order(Puromycin$conc), ]
head(Tmp)
</pre>


<pre class="example">
   conc rate     state
1  0.02   76   treated
2  0.02   47   treated
13 0.02   67 untreated
14 0.02   51 untreated
3  0.06   97   treated
4  0.06  107   treated
</pre>


<p>
We can accomplish the same thing with the command 
</p>



<pre class="src src-R">with(Puromycin, Puromycin[order(conc), ])
</pre>


<p>
We can sort by more than one variable. To sort first by <code>state</code> and next by <code>conc</code> do 
</p>



<pre class="src src-R">with(Puromycin, Puromycin[order(state, conc), ])
</pre>


<p>
If we would like to sort a numeric variable in descending order then we put a minus sign in front of it. 
</p>



<pre class="src src-R">Tmp <span style="color: #008b8b;">&lt;-</span> with(Puromycin, Puromycin[order(-conc), ])
head(Tmp)
</pre>


<pre class="example">
   conc rate     state
11 1.10  207   treated
12 1.10  200   treated
23 1.10  160 untreated
9  0.56  191   treated
10 0.56  201   treated
21 0.56  144 untreated
</pre>


<p>
If we would like to sort by a character (or factor) in decreasing order then we can use the <code>xtfrm</code> function which produces a numeric vector in the same order as the character vector.
</p>



<pre class="src src-R">Tmp <span style="color: #008b8b;">&lt;-</span> with(Puromycin, Puromycin[order(-xtfrm(state)), ])
head(Tmp)
</pre>


<pre class="example">
   conc rate     state
13 0.02   67 untreated
14 0.02   51 untreated
15 0.06   84 untreated
16 0.06   86 untreated
17 0.11   98 untreated
18 0.11  115 untreated
</pre>


</div>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5">Exporting Data</h3>
<div class="outline-text-3" id="text-5-5">


<p>
The basic function is <code>write.table</code>. The <code>MASS</code> package also has a <code>write.matrix</code> function.
</p>
</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6">Reshaping Data</h3>
<div class="outline-text-3" id="text-5-6">

<ul>
<li>Aggregation
</li>
<li>Convert Tables to data frames and back
</li>
</ul>


<p>
<code>rbind</code>, <code>cbind</code>
<code>ab[order(ab[,1]),]</code>
<code>complete.cases</code>
<code>aggregate</code>
<code>stack</code>
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Mathematical Machinery</h2>
<div class="outline-text-2" id="text-6">


<p>
This appendix houses many of the standard definitions and theorems that are used at some point during the narrative. It is targeted for someone reading the book who forgets the precise definition of something and would like a quick reminder of an exact statement. No proofs are given, and the interested reader should consult a good text on Calculus (say, Stewart \cite{Stewart2008} or Apostol \cite{Apostol1967,ApostolI1967}), Linear Algebra (say, Strang \cite{Strang1988} and Magnus \cite{Magnus1999}), Real Analysis (say, Folland \cite{Folland1999}, or Carothers \cite{Carothers2000}), or Measure Theory (Billingsley \cite{Billingsley1995}, Ash \cite{Ash2000}, Resnick \cite{Resnick1999}) for details. 
</p>


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Set Algebra</h3>
<div class="outline-text-3" id="text-6-1">


<p>
We denote sets by capital letters, \(A\), \(B\), \(C\), <i>etc</i>. The letter \(S\) is reserved for the sample space, also known as the universe or universal set, the set which contains all possible elements. The symbol \(\emptyset\) represents the empty set, the set with no elements. 
</p>


</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1">Set Union, Intersection, and Difference</h4>
<div class="outline-text-4" id="text-6-1-1">


<p>
Given subsets \(A\) and \(B\), we may manipulate them in an algebraic fashion. To this end, we have three set operations at our disposal: union, intersection, and difference. Below is a table summarizing the pertinent information about these operations.
</p>
<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="tab-Set-Operations">
<caption>Set operations.</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Name</th><th scope="col" class="left">Denoted</th><th scope="col" class="left">Defined by elements</th><th scope="col" class="left">\(\mathsf{R}\) syntax</th></tr>
</thead>
<tbody>
<tr><td class="left">Union</td><td class="left">\(A\cup B\)</td><td class="left">in \(A\) or \(B\) or both</td><td class="left"><code>union(A, B)</code></td></tr>
<tr><td class="left">Intersection</td><td class="left">\(A\cap B\)</td><td class="left">in both \(A\) and \(B\)</td><td class="left"><code>intersect(A, B)</code></td></tr>
<tr><td class="left">Difference</td><td class="left">\(A\textbackslash B\)</td><td class="left">in \(A\) but not in \(B\)</td><td class="left"><code>setdiff(A, B)</code></td></tr>
<tr><td class="left">Complement</td><td class="left">\(A^{c}\)</td><td class="left">in \(S\) but not in \(A\)</td><td class="left"><code>setdiff(S, A)</code></td></tr>
</tbody>
</table>




</div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2">Identities and Properties</h4>
<div class="outline-text-4" id="text-6-1-2">


<ol>
<li>\(A\cup\emptyset=A,\quad A\cap\emptyset=\emptyset\)
</li>
<li>\(A\cup S=S,\quad A\cap S=A\)
</li>
<li>\(A\cup A^{c}=S\), \(A\cap A^{c}=\emptyset\)
</li>
<li>\((A{}^{c})^{c}=A\)
</li>
<li>The Commutative Property: 
   \begin{equation}
   A \cup B = B\cup A,\quad A\cap B = B\cap A
   \end{equation}
</li>
<li>The Associative Property: 
   \begin{equation}
   (A\cup B)\cup C=A\cup(B\cup C),\quad(A\cap B)\cap C=A\cap(B\cap C)
   \end{equation}
</li>
<li>The Distributive Property: 
   \begin{equation}
   A\cup(B\cap C)=(A\cup B)\cap(A\cup B),\quad A\cap(B\cup C)=(A\cap B)\cup(A\cap B)
   \end{equation}
</li>
<li>DeMorgan's Laws
   \begin{equation}
   (A\cup B)^{c}=A^{c}\cap B^{c}\quad\mbox{and}\quad(A\cap B)^{c}=A^{c}\cup B^{c},
   \end{equation}
   or more generally,
   \begin{equation}
   \left(\bigcup_{\alpha}A_{\alpha}\right)^{c}=\bigcap_{\alpha}A_{\alpha}^{c},\quad\mbox{and}\quad\left(\bigcap_{\alpha}A_{\alpha}\right)^{c}=\bigcup_{\alpha}A_{\alpha}^{c}
   \end{equation}
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Differential and Integral Calculus</h3>
<div class="outline-text-3" id="text-6-2">


<p>
A function \(f\) of one variable is said to be one-to-one if no two distinct \(x\) values are mapped to the same \(y=f(x)\) value. To show that a function is one-to-one we can either use the horizontal line test or we may start with the equation \(f(x_{1}) = f(x_{2})\) and use algebra to show that it implies \(x_{1} = x_{2}\).
</p>

</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1">Limits and Continuity</h4>
<div class="outline-text-4" id="text-6-2-1">

<p><div class="defn">
Let \(f\) be a function defined on some open interval that contains the number \(a\), except possibly at \(a\) itself. Then we say the <i>limit of</i> \(f(x)\) <i>as</i> \(x\) <i>approaches</i> \(a\) <i>is</i> \(L\), and we write 
\begin{equation}
\lim_{x \to a}f(x) = L,
\end{equation}
if for every \(\epsilon &gt; 0\) there exists a number \(\delta &gt; 0\) such that \(0 &lt; |x-a| &lt; \delta\) implies \(|f(x) - L| &lt; \epsilon\).
</div>
</p>
<p>
<div class="defn">
A function \(f\) is <i>continuous at a number</i> \(a\) if 
\begin{equation}
\lim_{x \to a} f(x) = f(a).
\end{equation}
The function \(f\) is <i>right-continuous at the number</i> \(a\) if \(\lim_{x\to a^{+}}f(x)=f(a)\), and <i>left-continuous</i> at \(a\) if \(\lim_{x\to a^{-}}f(x)=f(a)\). Finally, the function \(f\) is <i>continuous on an interval</i> \(I\) if it is continuous at every number in the interval. 
</div>
</p>
</div>

</div>
