appendix.html

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2">Differentiation</h4>
<div class="outline-text-4" id="text-6-2-2">

<p><div class="defn">
The <i>derivative of a function</i> \(f\) <i>at a number</i> \(a\), denoted by \(f'(a)\), is
\begin{equation}
f'(a)=\lim_{h\to0}\frac{f(a+h)-f(a)}{h},
\end{equation}
provided this limit exists.
A function is <i>differentiable at</i> \(a\) if \(f'(a)\) exists. It is <i>differentiable on an open interval</i> \((a,b)\) if it is differentiable at every number in the interval.
</div>
</p>


<p>
In the table that follows, \(f\) and \(g\) are differentiable functions and \(c\) is a constant.
</p>
<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="tab-Differentiation-Rules">
<caption>Differentiation rules.</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}c=0\)</td><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}x^{n}=nx^{n-1}\)</td><td class="left">\((cf)'=cf'\)</td></tr>
<tr><td class="left">\((f\pm g)'=f'\pm g'\)</td><td class="left">\((fg)'=f'g+fg'\)</td><td class="left">\(\left(\frac{f}{g}\right)'=\frac{f'g-fg'}{g^{2}}\)</td></tr>
</tbody>
</table>


<p>
<div class="thm">
Chain Rule: If \(f\) and \(g\) are both differentiable and \(F=f\circ g\) is the composite function defined by \(F(x)=f[g(x)]\), then \(F\) is differentiable and \(F'(x) = f'[ g(x) ] \cdot g'(x)\).  
</div>
</p>


<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="tab-Useful-Derivatives">
<caption>Some derivatives.</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\mathrm{e}^{x}=\mathrm{e}^{x}\)</td><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\ln x=x^{-1}\)</td><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\sin x=\cos x\)</td></tr>
<tr><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\cos x=-\sin x\)</td><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\tan x=\sec^{2}x\)</td><td class="left">\(\frac{\mathrm{d}}{\mathrm{d} x}\tan^{-1}x=(1+x^{2})^{-1}\)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6-2-3" class="outline-4">
<h4 id="sec-6-2-3">Optimization</h4>
<div class="outline-text-4" id="text-6-2-3">

<p><div class="defn">
A <i>critical number</i> of the function \(f\) is a value \(x^{\ast}\) for which \(f'(x^{\ast})=0\) or for which \(f'(x^{\ast})\) does not exist.
</div>
</p>
<p>
<div class="thm">
First Derivative Test. If \(f\) is differentiable and if \(x^{\ast}\) is a critical number of \(f\) and if \(f'(x)\geq0\) for \(x\leq x^{\ast}\) and \(f'(x)\leq0\) for \(x\geq x^{\ast}\), then \(x^{\ast}\) is a local maximum of \(f\). If \(f'(x)\leq0\) for \(x\leq x^{\ast}\) and \(f'(x)\geq0\) for \(x\geq x^{\ast}\) , then \(x^{\ast}\) is a local minimum of \(f\).
</div>
</p>
<p>
<div class="thm">
Second Derivative Test. If \(f\) is twice differentiable and if \(x^{\ast}\) is a critical number of \(f\), then \(x^{\ast}\) is a local maximum of \(f\) if \(f''(x^{\ast})&lt;0\) and \(x^{\ast}\) is a local minimum of \(f\) if \(f''(x^{\ast})&gt;0\).
</div>
</p>
</div>

</div>

<div id="outline-container-6-2-4" class="outline-4">
<h4 id="sec-6-2-4">Integration</h4>
<div class="outline-text-4" id="text-6-2-4">

<p>As it turns out, there are all sorts of things called ``integrals'', each defined in its own idiosyncratic way. There are <i>Riemann</i> integrals, <i>Lebesgue</i> integrals, variants of these called <i>Stieltjes</i> integrals, <i>Daniell</i> integrals, <i>Ito</i> integrals, and the list continues. Given that this is an introductory book, we will use the Riemannian integral with the caveat that the Riemann integral is <i>not</i> the integral that will be used in more advanced study.
</p>
<p>
<div class="defn">
Let \(f\) be defined on \([a,b]\), a closed interval of the real line. For each \(n\), divide \([a,b]\) into subintervals \([x_{i},x_{i+1}]\), \(i=0,1,\ldots,n-1\), of length \(\Delta x_{i}=(b-a)/n\) where \(x_{0}=a\) and \(x_{n}=b\), and let \(x_{i}^{\ast}\) be any points chosen from the respective subintervals. Then the <i>definite integral</i> of \(f\) from \(a\) to \(b\) is defined by
\begin{equation}
\int_{a}^{b}f(x)\,\mathrm{d} x=\lim_{n\to\infty}\sum_{i=0}^{n-1}f(x_{i}^{\ast})\,\Delta x_{i},
\end{equation}
provided the limit exists, and in that case, we say that \(f\) is <i>integrable</i> from \(a\) to \(b\). 
</div>
</p>
<p>
<div class="thm">
The Fundamental Theorem of Calculus. Suppose \(f\) is continuous on \([a,b]\). Then
</p><ol>
<li>the function \(g\) defined by \(g(x)=\int_{a}^{x}f(t)\:\mathrm{d} t\), \(a\leq x\leq b\), is continuous on \([a,b]\) and differentiable on \((a,b)\) with \(g'(x)=f(x)\).
</li>
<li>\(\int_{a}^{b}f(x)\,\mathrm{d} x=F(b)-F(a)\), where \(F\) is any <i>antiderivative</i> of \(f\), that is, any function \(F\) satisfying \(F'=f\).
</li>
</ol>


<p>
</div>
</p>

<p>
<div class="thm">
If \(g\) is a differentiable function whose range is the interval \([a,b]\) and if both \(f\) and \(g'\) are continuous on the range of \(u = g(x)\), then
\begin{equation}
\int_{g(a)}^{g(b)}f(u)\:\mathrm{d} u=\int_{a}^{b}f[g(x)]\: g'(x)\:\mathrm{d} x.
\end{equation}
</div>
</p>


<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="tab-Useful-Integrals">
<caption>Some integrals (constants of integration omitted).</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">\(\int x^{n}\,\mathrm{d} x=x^{n+1}/(n+1),\ n\neq-1\)</td><td class="left">\(\int\mathrm{e}^{x}\,\mathrm{d} x=\mathrm{e}^{x}\)</td><td class="left">\(\int x^{-1}\,\mathrm{d} x=\ln \mathrm{abs}(x) \)</td></tr>
<tr><td class="left">\(\int\tan x\:\mathrm{d} x=\ln \mathrm{abs}(\sec x)\)</td><td class="left">\(\int a^{x}\,\mathrm{d} x=a^{x}/\ln a\)</td><td class="left">\(\int(x^{2}+1)^{-1}\,\mathrm{d} x=\tan^{-1}x\)</td></tr>
</tbody>
</table>





\begin{equation}
\int u\:\mathrm{d} v=uv-\int v\:\mathrm{d} u
\end{equation}
<p>
<div class="thm">
L'H^ opital's Rule. Suppose \(f\) and \(g\) are differentiable and \(g'(x)\neq0\) near \(a\), except possibly at \(a\). Suppose that the limit 
\begin{equation}
\lim_{x\to a}\frac{f(x)}{g(x)}
\end{equation}
is an indeterminate form of type \(\frac{0}{0}\) or \(\infty/\infty\). Then
\begin{equation}
\lim_{x\to a}\frac{f(x)}{g(x)}=\lim_{x\to a}\frac{f'(x)}{g'(x)},
\end{equation}
provided the limit on the right-hand side exists or is infinite.
</div>
</p>

<p>
If \(\int_{a}^{t}f(x)\mathrm{d} x\) exists for every number \(t\geq a\), then we define 
\begin{equation}
\int_{a}^{\infty}f(x)\,\mathrm{d} x=\lim_{t\to\infty}\int_{a}^{t}f(x)\,\mathrm{d} x,
\end{equation}
provided this limit exists as a finite number, and in that case we say that \(\int_{a}^{\infty}f(x)\,\mathrm{d} x\) is <i>convergent</i>. Otherwise, we say that the improper integral is <i>divergent</i>.
</p>
<p>
If \(\int_{t}^{b}f(x)\,\mathrm{d} x\) exists for every number \(t\leq b\), then we define
\begin{equation}
\int_{-\infty}^{b}f(x)\,\mathrm{d} x=\lim_{t\to-\infty}\int_{t}^{b}f(x)\,\mathrm{d} x,
\end{equation}
provided this limit exists as a finite number, and in that case we say that \(\int_{-\infty}^{b}f(x)\,\mathrm{d} x\) is <i>convergent</i>. Otherwise, we say that the improper integral is <i>divergent</i>.
</p>
<p>
If both \(\int_{a}^{\infty}f(x)\,\mathrm{d} x\) and \(\int_{-\infty}^{a}f(x)\,\mathrm{d} x\) are convergent, then we define
\begin{equation}
\int_{-\infty}^{\infty}f(x)\,\mathrm{d} x=\int_{-\infty}^{a}f(x)\,\mathrm{d} x+\int_{a}^{\infty}f(x)\mathrm{d} x,
\end{equation}
and we say that \(\int_{-\infty}^{\infty}f(x)\,\mathrm{d} x\) is <i>convergent</i>. Otherwise, we say that the improper integral is <i>divergent</i>.
</p>

</div>
</div>

</div>
