appendix.org
** Sequences and Series \label{sec:Sequences-and-Series}

A /sequence/ is an ordered list of numbers, \(a_{1}\), \(a_{2}\), \(a_{3}\), ..., \(a_{n} =\left(a_{k}\right)_{k=1}^{n}\). A sequence may be finite or infinite. In the latter case we write \(a_{1}\), \(a_{2}\), \(a_{3}\), ... \( =\left(a_{k}\right)_{k=1}^{\infty}\). We say that /the infinite sequence/ \(\left(a_{k}\right)_{k=1}^{\infty}\) /converges to the finite limit/ L, and we write
\begin{equation}
\lim_{k\to\infty}a_{k} = L,
\end{equation}
if for every \(\epsilon > 0\) there exists an integer \(N \geq 1\) such that \(|a_{k} - L| < \epsilon\) for all \(k \geq N\). We say that /the infinite sequence/ \(\left(a_{k}\right)_{k=1}^{\infty}\) /diverges to/ \(+\infty\) (or \( -\infty\)) if for every \(M\geq0\) there exists an integer \(N\geq1\) such that \(a_{k} \geq M\) for all \(k \geq N\) (or \(a_{k} \leq - M\) for all \(k \geq N\)).


*** Finite Series

\begin{equation}
\sum_{k=1}^{n}k=1+2+\cdots+n=\frac{n(n+1)}{2}\label{eq:gauss-series}
\end{equation}
\begin{equation}
\sum_{k=1}^{n}k^{2}=1^{2}+2^{2}+\cdots+n^{2}=\frac{n(n+1)(2n+3)}{6}\label{eq:gauss-series-sq}
\end{equation}


#+latex: \paragraph*{The Binomial Series}
\begin{equation}
\sum_{k=0}^{n}{n \choose k}\, a^{n-k}b^{k}=(a+b)^{n}\label{eq:binom-series}
\end{equation}

*** Infinite Series

Given an infinite sequence of numbers \(a_{1}\), \(a_{2}\), \(a_{3}\), ...\(=\left(a_{k}\right)_{k=1}^{\infty}\), let \(s_{n}\) denote the /partial sum/ of the first \(n\) terms:
\begin{equation}
s_{n}=\sum_{k=1}^{n}a_{k}=a_{1}+a_{2}+\cdots+a_{n}.
\end{equation}
If the sequence \(\left(s_{n}\right)_{n=1}^{\infty}\) converges to a finite number \(S\) then we say that the infinite series \(\sum_{k}a_{k}\) is /convergent/ and write
\begin{equation}
\sum_{k=1}^{\infty}a_{k}=S.
\end{equation}
Otherwise we say the infinite series is /divergent/.


*** Rules for Series

Let \(\left(a_{k}\right)_{k=1}^{\infty}\) and \(\left(b_{k}\right)_{k=1}^{\infty}\) be infinite sequences and let \(c\) be a constant.

\begin{equation}
\sum_{k=1}^{\infty}ca_{k}=c\sum_{k=1}^{\infty}a_{k}
\end{equation}
\begin{equation}
\sum_{k=1}^{\infty}(a_{k}\pm b_{k})=\sum_{k=1}^{\infty}a_{k}\pm\sum_{k=1}^{\infty}b_{k}
\end{equation}

In both of the above the series on the left is convergent if the series on the right is (are) convergent.

#+latex: \paragraph*{The Geometric Series}
\begin{equation}
\sum_{k=0}^{\infty} x^{k} = \frac{1}{1 - x},\quad|x| < 1.\label{eq:geom-series}
\end{equation}

#+latex: \paragraph*{The Exponential Series}
\begin{equation}
\sum_{k=0}^{\infty}\frac{x^{k}}{k!} = \mathrm{e}^{x},\quad -\infty < x < \infty. \label{eq:exp-series}
\end{equation}

Other Series
\begin{equation}
\sum_{k=0}^{\infty}{m+k-1 \choose m-1}x^{k}=\frac{1}{(1-x)^{m}},\quad|x|<1.\label{eq:negbin-series}
\end{equation}
\begin{equation}
-\sum_{k=1}^{\infty}\frac{x^{n}}{n}=\ln(1-x),\quad|x|<1.\label{eq:log-series}
\end{equation}
\begin{equation}
\sum_{k=0}^{\infty}{n \choose k}x^{k}=(1+x)^{n},\quad|x|<1.\label{eq:binom-series-infinite}
\end{equation}



*** Taylor Series

If the function \(f\) has a /power series/ representation at the point \(a\) with radius of convergence \(R>0\), that is, if
\begin{equation}
f(x)=\sum_{k=0}^{\infty}c_{k}(x-a)^{k},\quad|x-a|<R,
\end{equation}
for some constants \(\left(c_{k}\right)_{k=0}^{\infty}\), then \(c_{k}\) must be
\begin{equation}
c_{k}=\frac{f^{(k)}(a)}{k!},\quad k=0,1,2,\ldots
\end{equation}
Furthermore, the function \(f\) is differentiable on the open interval \((a-R,\, a+R)\) with
\begin{equation}
f'(x)=\sum_{k=1}^{\infty}kc_{k}(x-a)^{k-1},\quad|x-a|<R,
\end{equation}
\begin{equation}
\int f(x)\,\mathrm{d} x=C+\sum_{k=0}^{\infty}c_{k}\frac{(x-a)^{k+1}}{k+1},\quad|x-a|<R,
\end{equation}
in which case both of the above series have radius of convergence \(R\).


** The Gamma Function \label{sec:The-Gamma-Function}

The /Gamma function/ \(\Gamma\) will be defined in this book according to the formula
\begin{equation}
\Gamma(\alpha)=\int_{0}^{\infty}x^{\alpha-1}\mathrm{e}^{-x}\:\mathrm{d} x,\quad\mbox{for }\alpha > 0.
\end{equation}

#+latex: \begin{fact}
Properties of the Gamma Function:
- \(\Gamma(\alpha)=(\alpha - 1)\Gamma(\alpha - 1)\) for any \(\alpha > 1\), and so \(\Gamma(n)=(n-1)!\) for any positive integer \(n\).
- \(\Gamma(1/2)=\sqrt{\pi}\).
#+latex: \end{fact}

** Linear Algebra \label{sec:Linear-Algebra}
*** Matrices
A /matrix/ is an ordered array of numbers or expressions; typically we write \(\mathbf{A}=\begin{pmatrix}a_{ij}\end{pmatrix}\) or \(\mathbf{A}=\begin{bmatrix}a_{ij}\end{bmatrix}\). If \(\mathbf{A}\) has \(m\) rows and \(n\) columns then we write
\begin{equation}
\mathbf{A}_{\mathrm{m}\times\mathrm{n}}=\begin{bmatrix}a_{11} & a_{12} & \cdots & a_{1n}\\
a_{21} & a_{22} & \cdots & a_{2n}\\
\vdots & \vdots & \ddots & \vdots\\
a_{m1} & a_{m2} & \cdots & a_{mn}\end{bmatrix}.
\end{equation}
The /identity matrix/ \(\mathbf{I}_{\mathrm{n}\times\mathrm{n}}\) is an \(\mathrm{n}\times\mathrm{n}\) matrix with zeros everywhere except for 1's along the main diagonal: 
\begin{equation}
\mathbf{I}_{\mathrm{n}\times\mathrm{n}}=\begin{bmatrix}1 & 0 & \cdots & 0\\
0 & 1 & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots\\
0 & 0 & \cdots & 1\end{bmatrix}.
\end{equation}
and the matrix with ones everywhere is denoted \(\mathbf{J}_{\mathrm{n}\times\mathrm{n}}\):
\begin{equation}
\mathbf{J}_{\mathrm{n}\times\mathrm{n}}=\begin{bmatrix}1 & 1 & \cdots & 1\\
1 & 1 & \cdots & 1\\
\vdots & \vdots & \ddots & \vdots\\
1 & 1 & \cdots & 1\end{bmatrix}.
\end{equation}

A /vector/ is a matrix with one of the dimensions equal to one, such as \(\mathbf{A}_{\mathrm{m}\times1}\) (a column vector) or \(\mathbf{A}_{\mathrm{1}\times\mathrm{n}}\) (a row vector). The /zero vector/ \(\mathbf{0}_{\mathrm{n}\times1}\)
is an \(\mathrm{n}\times1\) matrix of zeros:
\begin{equation}
\mathbf{0}_{\mathrm{n}\times1}=\begin{bmatrix}0 & 0 & \cdots & 0\end{bmatrix}^{\mathrm{T}}.
\end{equation}

The /transpose/ of a matrix \(\mathbf{A}=\begin{pmatrix}a_{ij}\end{pmatrix}\) is the matrix \(\mathbf{A}^{\mathrm{T}}=\begin{pmatrix}a_{ji}\end{pmatrix}\), which is just like \(\mathbf{A}\) except the rows are columns and the columns are rows. The matrix \(\mathbf{A}\) is said to be /symmetric/ if \(\mathbf{A}^{\mathrm{T}}=\mathbf{A}\). Note that \(\left(\mathbf{A}\mathbf{B}\right)^{\mathrm{T}}=\mathbf{B}^{\mathrm{T}}\mathbf{A}^{\mathrm{T}}\).

The /trace/ of a square matrix \(\mathbf{A}\) is the sum of its diagonal elements: \(\mathrm{tr}(\mathbf{A})=\sum_{i}a_{ii}\). 

The /inverse/ of a square matrix \(\mathbf{A}_{\mathrm{n}\times\mathrm{n}}\) (when it exists) is the unique matrix denoted \(\mathbf{A}^{-1}\) which satisfies \(\mathbf{A}\mathbf{A}^{-1}=\mathbf{A}^{-1}\mathbf{A}=\mathbf{I}_{\mathrm{n}\times\mathrm{n}}\). If \(\mathbf{A}^{-1}\) exists then we say \(\mathbf{A}\) is /invertible/, or /nonsingular/. Note that \(\left(\mathbf{A}^{\mathrm{T}}\right)^{-1}=\left(\mathbf{A}^{\mathrm{-1}}\right)^{\mathrm{T}}\).
#+latex: \begin{fact}
The inverse of the \(2\times2\) matrix
\begin{equation}
\mathbf{A}=\begin{bmatrix}a & b\\
c & d\end{bmatrix}\quad\mbox{is}\quad\mathbf{A}^{-1}=\frac{1}{ad-bc}\begin{bmatrix}d & -b\\
-c & a\end{bmatrix},
\end{equation}
provided \(ad-bc\neq0\).
#+latex: \end{fact}

