appendix.html

<div id="outline-container-6-5-2" class="outline-4">
<h4 id="sec-6-5-2">Determinants</h4>
<div class="outline-text-4" id="text-6-5-2">

<p><div class="defn">
The <i>determinant</i> of a square matrix \(\mathbf{A}_{\mathrm{n}\times n}\) is denoted \(\mathrm{det}(\mathbf{A})\) or \(|\mathbf{A}|\) and is defined recursively by
\begin{equation}
\mathrm{det}(\mathbf{A})=\sum_{i=1}^{n}(-1)^{i+j}a_{ij}\,\mathrm{det}(\mathbf{M}_{ij}),
\end{equation}
where \(\mathbf{M}_{ij}\) is the submatrix formed by deleting the \(i^{\mathrm{th}}\) row and \(j^{\mathrm{th}}\) column of \(\mathbf{A}\). We may choose any fixed \(1\leq j\leq n\) we wish to compute the determinant; the final result is independent of the \(j\) chosen.
</div>
<div class="fact">
The determinant of the \(2\times2\) matrix
\begin{equation}
\mathbf{A}=\begin{bmatrix}a & b\\
c & d\end{bmatrix}\quad\mbox{is}\quad|\mathbf{A}|=ad-bc.
\end{equation}
</div>
</p>
<p>
<div class="fact">
A square matrix \(\mathbf{A}\) is nonsingular if and only if \(\mathrm{det}(\mathbf{A})\neq0\).
</div>
</p>
</div>

</div>

<div id="outline-container-6-5-3" class="outline-4">
<h4 id="sec-6-5-3">Positive (Semi)Definite</h4>
<div class="outline-text-4" id="text-6-5-3">

<p>If the matrix \(\mathbf{A}\) satisfies \(\mathbf{x^{\mathrm{T}}}\mathbf{A}\mathbf{x}\geq0\) for all vectors \(\mathbf{x}\neq\mathbf{0}\), then we say that \(\mathbf{A}\) is <i>positive semidefinite</i>. If strict inequality holds for all \(\mathbf{x}\neq\mathbf{0}\), then \(\mathbf{A}\) is <i>positive definite</i>. The connection to statistics is that covariance matrices (see Chapter <a href="#cha-Multivariable-Distributions">Multivariable-Distributions</a>) are always positive semidefinite, and many of them are even positive definite.
</p>
</div>
</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">Multivariable Calculus</h3>
<div class="outline-text-3" id="text-6-6">


</div>

<div id="outline-container-6-6-1" class="outline-4">
<h4 id="sec-6-6-1">Partial Derivatives</h4>
<div class="outline-text-4" id="text-6-6-1">

<p>If \(f\) is a function of two variables, its <i>first-order partial derivatives</i> are defined by
\begin{equation}
\frac{\partial f}{\partial x}=\frac{\partial}{\partial x}f(x,y)=\lim_{h\to0}\frac{f(x+h,\, y)-f(x,y)}{h}
\end{equation}
and
\begin{equation}
\frac{\partial f}{\partial y}=\frac{\partial}{\partial y}f(x,y)=\lim_{h\to0}\frac{f(x,\, y+h)-f(x,y)}{h},
\end{equation}
provided these limits exist. The <i>second-order partial derivatives</i> of \(f\) are defined by
\begin{equation}
\frac{\partial^{2}f}{\partial x^{2}}=\frac{\partial}{\partial x}\left(\frac{\partial f}{\partial x}\right),\quad\frac{\partial^{2}f}{\partial y^{2}}=\frac{\partial}{\partial y}\left(\frac{\partial f}{\partial y}\right),\quad\frac{\partial^{2}f}{\partial x\partial y}=\frac{\partial}{\partial x}\left(\frac{\partial f}{\partial y}\right),\quad\frac{\partial^{2}f}{\partial y\partial x}=\frac{\partial}{\partial y}\left(\frac{\partial f}{\partial x}\right).
\end{equation}
In many cases (and for all cases in this book) it is true that
\begin{equation}
\frac{\partial^{2}f}{\partial x\partial y}=\frac{\partial^{2}f}{\partial y\partial x}.
\end{equation}

</p></div>

</div>

<div id="outline-container-6-6-2" class="outline-4">
<h4 id="sec-6-6-2">Optimization</h4>
<div class="outline-text-4" id="text-6-6-2">

<p>An function \(f\) of two variables has a <i>local maximum</i> at \((a,b)\) if \(f(x,y)\geq f(a,b)\) for all points \((x,y)\) near \((a,b)\), that is, for all points in an open disk centered at \((a,b)\). The number \(f(a,b)\) is then called a <i>local maximum value</i> of \(f\). The function \(f\) has a <i>local minimum</i> if the same thing happens with the inequality reversed.
</p>
<p>
Suppose the point \((a,b)\) is a <i>critical point</i> of \(f\), that is, suppose \((a,b)\) satisfies 
\begin{equation}
\frac{\partial f}{\partial x}(a,b)=\frac{\partial f}{\partial y}(a,b)=0.
\end{equation}
Further suppose \(\frac{\partial^{2}f}{\partial x^{2}}\) and \(\frac{\partial^{2}f}{\partial y^{2}}\) are continuous near \((a,b)\). Let the <i>Hessian matrix</i> \(H\) (not to be confused with the <i>hat matrix</i> \(\mathbf{H}\) of Chapter <a href="#cha-multiple-linear-regression">multiple-linear-regression</a>) be defined by
\begin{equation}
H = 
\begin{bmatrix}
\frac{\partial^{2}f}{\partial x^{2}} & \frac{\partial^{2}f}{\partial x\partial y}\\
\frac{\partial^{2}f}{\partial y\partial x} & \frac{\partial^{2}f}{\partial y^{2}}
\end{bmatrix}.
\end{equation}
We use the following rules to decide whether \((a,b)\) is an <i>extremum</i> (that is, a local minimum or local maximum) of \(f\).
</p><ul>
<li>If \(\mbox{det}(H)&gt;0\) and \(\frac{\partial^{2}f}{\partial x^{2}}(a,b)&gt;0\), then \((a,b)\) is a local minimum of \(f\).
</li>
<li>If \(\mbox{det}(H)&gt;0\) and \(\frac{\partial^{2}f}{\partial x^{2}}(a,b)&lt;0\), then \((a,b)\) is a local maximum of \(f\).
</li>
<li>If \(\mbox{det}(H)&lt;0\), then \((a,b)\) is a <i>saddle point</i> of \(f\) and so is not an extremum of \(f\).
</li>
<li>If \(\mbox{det}(H)=0\), then we do not know the status of \((a,b)\); it might be an extremum or it might not be.
</li>
</ul>



</div>

</div>

<div id="outline-container-6-6-3" class="outline-4">
<h4 id="sec-6-6-3">Double and Multiple Integrals</h4>
<div class="outline-text-4" id="text-6-6-3">

<p>Let \(f\) be defined on a rectangle \(R=[a,b]\times[c,d]\), and for each \(m\) and \(n\) divide \([a,b]\) (respectively \([c,d]\)) into subintervals \([x_{j},x_{j+1}]\), \(i=0,1,\ldots,m-1\) (respectively \([y_{i},y_{i+1}]\)) of length \(\Delta x_{j}=(b-a)/m\) (respectively \(\Delta y_{i}=(d-c)/n\)) where \(x_{0}=a\) and \(x_{m}=b\) (and \(y_{0}=c\) and \(y_{n}=d\) ), and let \(x_{j}^{\ast}\) (\(y_{i}^{\ast}\)) be any points chosen from their respective subintervals. Then the <i>double integral</i> of \(f\) over the rectangle \(R\) is
\begin{equation}
\iintop_{R}f(x,y)\,\mathrm{d} A=\intop_{c}^{d}\!\!\!\intop_{a}^{b}f(x,y)\,\mathrm{d} x\mathrm{d} y=\lim_{m,n\to\infty}\sum_{i=1}^{n}\sum_{j=1}^{m}f(x_{j}^{\ast},y_{i}^{\ast})\Delta x_{j}\Delta y_{i},
\end{equation}
provided this limit exists. Multiple integrals are defined in the same way just with more letters and sums.
</p>

</div>

</div>

<div id="outline-container-6-6-4" class="outline-4">
<h4 id="sec-6-6-4">Bivariate and Multivariate Change of Variables</h4>
<div class="outline-text-4" id="text-6-6-4">

<p>Suppose we have a transformation
\(T\) that maps points \((u,v)\) in a set \(A\) to points \((x,y)\) in a set \(B\). We typically write \(x=x(u,v)\) and \(y=y(u,v)\), and we assume that \(x\) and \(y\) have continuous first-order partial derivatives. We say that \(T\) is <i>one-to-one</i> if no two distinct \((u,v)\) pairs get mapped to the same \((x,y)\) pair; in this book, all of our multivariate transformations \(T\) are one-to-one.
</p>
<p>
The <i>Jacobian</i> (pronounced ``yah-KOH-bee-uhn'') of \(T\) is denoted by \(\partial(x,y)/\partial(u,v)\) and is defined by the determinant of the following matrix of partial derivatives:
\begin{equation}
\frac{\partial(x,y)}{\partial(u,v)}=\left|
\begin{array}{cc}
\frac{\partial x}{\partial u} & \frac{\partial x}{\partial v}\\
\frac{\partial y}{\partial u} & \frac{\partial y}{\partial v}
\end{array}
\right|=\frac{\partial x}{\partial u}\frac{\partial y}{\partial v}-\frac{\partial x}{\partial v}\frac{\partial y}{\partial u}.
\end{equation}

If the function \(f\) is continuous on \(A\) and if the Jacobian of \(T\) is nonzero except perhaps on the boundary of \(A\), then 
\begin{equation}
\iint_{B}f(x,y)\,\mathrm{d} x\,\mathrm{d} y=\iint_{A}f\left[x(u,v),\, y(u,v)\right]\ \left|\frac{\partial(x,y)}{\partial(u,v)}\right|\mathrm{d} u\,\mathrm{d} v.
\end{equation} 

A multivariate change of variables is defined in an analogous way: the one-to-one transformation \(T\) maps points \((u_{1},u_{2},\ldots,u_{n})\) to points \((x_{1},x_{2},\ldots,x_{n})\), the Jacobian is the determinant of the \(\mathrm{n}\times\mathrm{n}\) matrix of first-order partial derivatives of \(T\) (lined up in the natural manner), and instead of a double integral we have a multiple integral over multidimensional sets \(A\) and \(B\).
</p>
</div>
</div>
</div>

</div>
