appendix.org
* Writing Reports with \textsf{R}
\label{cha:Writing-Reports-with}

Perhaps the most important part of a statistician's job once the analysis is complete is to communicate the results to others. This is usually done with some type of report that is delivered to the client, manager, or administrator. Other situations that call for reports include term papers, final projects, thesis work, /etc/. This chapter is designed to pass along some tips about writing reports once the work is completed with \textsf{R}.


** What to Write \label{sec:What-to-Write}
It is possible to summarize this entire appendix with only one sentence: /the statistician's goal is to communicate with others/. To this end, there are some general guidelines that I give to students which are based on an outline originally written and shared with me by Dr.~G.~Andy Chang.

*** Basic Outline for a Statistical Report
1. Executive Summary (a one page description of the study and conclusion) 
1. Introduction 
   1. What is the question, and why is it important?
   1. Is the study observational or experimental?
   1. What are the hypotheses of interest to the researcher?
   1. What are the types of analyses employed? (one sample \(t\)-test, paired-sample \(t\)-test, ANOVA, chi-square test, regression, ...) 
1. Data Collection 
   1. Describe how the data were collected in detail.
   1. Identify all variable types: quantitative, qualitative, ordered or nominal (with levels), discrete, continuous.
   1. Discuss any limitations of the data collection procedure. Look carefully for any sources of bias.
1. Summary Information
   1. Give numeric summaries of all variables of interest.
      1. Discrete: (relative) frequencies, contingency tables, odds ratios, /etc/. 
      1. Continuous: measures of center, spread, shape.
   1. Give visual summaries of all variables of interest.
      1. Side-by-side boxplots, scatterplots, histograms, /etc/.
   1. Discuss any unusual features of the data (outliers, clusters, granularity, /etc/.)
   1. Report any missing data and identify any potential problems or bias.
1. Analysis 
   1. State any hypotheses employed, and check the assumptions. 
   1. Report test statistics, /p/-values, and confidence intervals. 
   1. Interpret the results in the context of the study.
   1. Attach (labeled) tables and/or graphs and make reference to them in the report as needed. 
1. Conclusion
   1. Summarize the results of the study. What did you learn? 
   1. Discuss any limitations of the study or inferences.
   1. Discuss avenues of future research suggested by the study. 

** How to Write It with R \label{sec:How-to-Write}
Once the decision has been made what to write, the next task is to typeset the information to be shared. To do this the author will need to select software to use to write the documents. There are many options available, and choosing one over another is sometimes a matter of taste. But not all software were created equal, and \textsf{R} plays better with some applications than it does with others. 
In short, \textsf{R} does great with \LaTeX{} and there are many resources available to make writing a document with \textsf{R} and \LaTeX{} easier. But \LaTeX{} is not for the beginner, and there are other word processors which may be acceptable depending on the circumstances.


*** Microsoft\(\circledR\) Word
It is a fact of life that Microsoft\(\circledR\) Windows is currently the most prevalent desktop operating system on the planet. Those who own Windows also typically own some version of Microsoft Office, thus Microsoft Word is the default word processor for many, many people.  

The standard way to write an \textsf{R} report with Microsoft\(\circledR\) Word is to generate material with \textsf{R} and then copy-paste the material at selected places in a Word document. An advantage to this approach is that Word is nicely designed to make it easy to copy-and-paste from \textsf{RGui} to the Word document.

A disadvantage to this approach is that the R input/output needs to be edited manually by the author to make it readable for others. Another disadvantage is that the approach does not work on all operating systems (not on Linux, in particular). Yet another disadvantage is that Microsoft\(\circledR\) Word is proprietary, and as a result, \textsf{R} does not communicate with Microsoft\(\circledR\) Word as well as it does with other software as we shall soon see.

Nevertheless, if you are going to write a report with Word there are some steps that you can take to make the report more amenable to the reader. 

1. Copy and paste graphs into the document. You can do this by right clicking on the graph and selecting \textsf{Copy as bitmap,} or \textsf{Copy as metafile}, or one of the other options. Then move the cursor to the document where you want the picture, right-click, and select \textsf{Paste}.
1. Resize (most) pictures so that they take up no more than 1/2 page. You may want to put graphs side by side; do this by inserting a table and placing the graphs inside the cells.
1. Copy selected \textsf{R} input and output to the Word document. All code should be separated from the rest of the writing, except when specifically mentioning a function or object in a sentence.
1. The font of \textsf{R} input/output should be Courier New, or some other monowidth font (not Times New Roman or Calibri); the default font size of =12= is usually too big for \textsf{R} code and should be reduced to, for example, =10pt=.

It is also possible to communicate with \textsf{R} through OpenOffice.org, which can export to the proprietary (=.doc=) format.


