appendix.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Writing Reports with \(\mathsf{R}\)</h2>
<div class="outline-text-2" id="text-7">


<p>
Perhaps the most important part of a statistician's job once the analysis is complete is to communicate the results to others. This is usually done with some type of report that is delivered to the client, manager, or administrator. Other situations that call for reports include term papers, final projects, thesis work, <i>etc</i>. This chapter is designed to pass along some tips about writing reports once the work is completed with \(\mathsf{R}\).
</p>


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">What to Write</h3>
<div class="outline-text-3" id="text-7-1">

<p>It is possible to summarize this entire appendix with only one sentence: <i>the statistician's goal is to communicate with others</i>. To this end, there are some general guidelines that I give to students which are based on an outline originally written and shared with me by Dr. G. Andy Chang.
</p>

</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1">Basic Outline for a Statistical Report</h4>
<div class="outline-text-4" id="text-7-1-1">

<ol>
<li>Executive Summary (a one page description of the study and conclusion) 
</li>
<li>Introduction 
<ol>
<li>What is the question, and why is it important?
</li>
<li>Is the study observational or experimental?
</li>
<li>What are the hypotheses of interest to the researcher?
</li>
<li>What are the types of analyses employed? (one sample \(t\)-test, paired-sample \(t\)-test, ANOVA, chi-square test, regression, &hellip;) 
</li>
</ol>

</li>
<li>Data Collection 
<ol>
<li>Describe how the data were collected in detail.
</li>
<li>Identify all variable types: quantitative, qualitative, ordered or nominal (with levels), discrete, continuous.
</li>
<li>Discuss any limitations of the data collection procedure. Look carefully for any sources of bias.
</li>
</ol>

</li>
<li>Summary Information
<ol>
<li>Give numeric summaries of all variables of interest.
<ol>
<li>Discrete: (relative) frequencies, contingency tables, odds ratios, <i>etc</i>. 
</li>
<li>Continuous: measures of center, spread, shape.
</li>
</ol>

</li>
<li>Give visual summaries of all variables of interest.
<ol>
<li>Side-by-side boxplots, scatterplots, histograms, <i>etc</i>.
</li>
</ol>

</li>
<li>Discuss any unusual features of the data (outliers, clusters, granularity, <i>etc</i>.)
</li>
<li>Report any missing data and identify any potential problems or bias.
</li>
</ol>

</li>
<li>Analysis 
<ol>
<li>State any hypotheses employed, and check the assumptions. 
</li>
<li>Report test statistics, <i>p</i>-values, and confidence intervals. 
</li>
<li>Interpret the results in the context of the study.
</li>
<li>Attach (labeled) tables and/or graphs and make reference to them in the report as needed. 
</li>
</ol>

</li>
<li>Conclusion
<ol>
<li>Summarize the results of the study. What did you learn? 
</li>
<li>Discuss any limitations of the study or inferences.
</li>
<li>Discuss avenues of future research suggested by the study. 
</li>
</ol>

</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">How to Write It with R</h3>
<div class="outline-text-3" id="text-7-2">

<p>Once the decision has been made what to write, the next task is to typeset the information to be shared. To do this the author will need to select software to use to write the documents. There are many options available, and choosing one over another is sometimes a matter of taste. But not all software were created equal, and \(\mathsf{R}\) plays better with some applications than it does with others. 
In short, \(\mathsf{R}\) does great with \LaTeX{} and there are many resources available to make writing a document with \(\mathsf{R}\) and \LaTeX{} easier. But \LaTeX{} is not for the beginner, and there are other word processors which may be acceptable depending on the circumstances.
</p>


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1">Microsoft\(\circledR\) Word</h4>
<div class="outline-text-4" id="text-7-2-1">

<p>It is a fact of life that Microsoft\(\circledR\) Windows is currently the most prevalent desktop operating system on the planet. Those who own Windows also typically own some version of Microsoft Office, thus Microsoft Word is the default word processor for many, many people.  
</p>
<p>
The standard way to write an \(\mathsf{R}\) report with Microsoft\(\circledR\) Word is to generate material with \(\mathsf{R}\) and then copy-paste the material at selected places in a Word document. An advantage to this approach is that Word is nicely designed to make it easy to copy-and-paste from <code>RGui</code> to the Word document.
</p>
<p>
A disadvantage to this approach is that the R input/output needs to be edited manually by the author to make it readable for others. Another disadvantage is that the approach does not work on all operating systems (not on Linux, in particular). Yet another disadvantage is that Microsoft\(\circledR\) Word is proprietary, and as a result, \(\mathsf{R}\) does not communicate with Microsoft\(\circledR\) Word as well as it does with other software as we shall soon see.
</p>
<p>
Nevertheless, if you are going to write a report with Word there are some steps that you can take to make the report more amenable to the reader. 
</p>
<ol>
<li>Copy and paste graphs into the document. You can do this by right clicking on the graph and selecting <code>Copy as bitmap</code>, or <code>Copy as metafile</code>, or one of the other options. Then move the cursor to the document where you want the picture, right-click, and select <code>Paste</code>.
</li>
<li>Resize (most) pictures so that they take up no more than 1/2 page. You may want to put graphs side by side; do this by inserting a table and placing the graphs inside the cells.
</li>
<li>Copy selected \(\mathsf{R}\) input and output to the Word document. All code should be separated from the rest of the writing, except when specifically mentioning a function or object in a sentence.
</li>
<li>The font of \(\mathsf{R}\) input/output should be Courier New, or some other monowidth font (not Times New Roman or Calibri); the default font size of <code>12</code> is usually too big for \(\mathsf{R}\) code and should be reduced to, for example, <code>10pt</code>.
</li>
</ol>


<p>
It is also possible to communicate with \(\mathsf{R}\) through OpenOffice.org, which can export to the proprietary (<code>.doc</code>) format.
</p>

</div>

</div>
