appendix.org
*** OpenOffice.org and \texttt{odfWeave}
OpenOffice.org (OO.o) is an open source desktop productivity suite which mirrors Microsoft\(\circledR\) Office. It is especially nice because it works on all operating systems. OO.o can read most document formats, and in particular, it will read =.doc= files. The standard OO.o file extension for documents is =.odt=, which stands for ``open document text''.

The =odfWeave=  package \cite{odfweave} provides a way to generate an =.odt= file with \textsf{R} input and output code formatted correctly and inserted in the correct places, without any additional work. In this way, one does not need to worry about all of the trouble of typesetting \textsf{R} output. Another advantage of =odfWeave= is that it allows you to generate the report dynamically; if the data underlying the report change or are updated, then a few clicks (or commands) will generate a brand new report.

One disadvantage is that the source =.odt=  file is not easy to read, because it is difficult to visually distinguish the noweb parts (where the \textsf{R} code is) from the non-noweb parts. This can be fixed by manually changing the font of the noweb sections to, for instance, Courier font, size =10pt=. But it is extra work. It would be nice if a program would discriminate between the two different sections and automatically typeset the respective parts in their correct fonts. This is one of the advantages to \LyX{}.

Another advantage of OO.o is that even after you have generated the outfile, it is fully editable just like any other =.odt= document. If there are errors or formatting problems, they can be fixed at any time.

Here are the basic steps to typeset a statistical report with OO.o.

1. Write your report as an =.odt= document in OO.o just as you would any other document. Call this document =infile.odt=, and make sure that it is saved in your working directory. 
1. At the places you would like to insert \textsf{R} code in the document, write the code chunks in the following format:
   \texttt{<\textcompwordmark{}<>\textcompwordmark{}>=}~\\
   \texttt{x <- rnorm(10)}~\\
   \texttt{mean(x)}~\\
   \texttt{@}
   or write whatever code you want between the symbols \texttt{<\textcompwordmark{}<>\textcompwordmark{}>=} and \texttt{@}.
1. Open \textsf{R} and type the following:
   #+begin_src R :exports code :eval never
   library(odfWeave)
   odfWeave(file = "infile.odt", dest = "outfile.odt")
   #+end_src
1. The compiled (=.odt=) file, complete with all of the \textsf{R} output automatically inserted in the correct places, will now be the file =outfile.odt= located in the working directory. Open =outfile.odt=, examine it, modify it, and repeat if desired. 

There are all sorts of extra things that you can do. For example, the \textsf{R} commands can be suppressed with the tag \texttt{<\textcompwordmark{}<echo = FALSE>\textcompwordmark{}>=}, and the \textsf{R} output may be hidden with \texttt{<\textcompwordmark{}<results = hide>\textcompwordmark{}>=}. See the =odfWeave= package documentation for details.

*** Sweave and \protect\LaTeX{}

This approach is nice because it works for all operating systems. One can quite literally typeset /anything/ with \LaTeX{}. All of this power comes at a price, however. The writer must learn the \LaTeX{} language which is a nontrivial enterprise. Even given the language, if there is a single syntax error, or a single delimeter missing in the entire document, then the whole thing breaks.

\LaTeX{} can do anything, but it is relatively difficult to learn  and very grumpy about syntax errors and delimiter matching. There are however programs useful for formatting LaTeX.

A disadvantage is that you cannot see the mathematical formulas until you run the whole file with \LaTeX{}.

A disadvantage is that figures and tables are relatively difficult.

There are programs to make the process easier: AUC\TeX{}.

dev.copy2eps, also dev.copy2pdf

\url{http://www.stat.uni-muenchen.de/~leisch/Sweave/}


*** Sweave and \protect\LyX{}
This approach is nice because it works for all operating  systems. It gives you everything from the last section and makes it easier to use \LaTeX{}. That being said, it is better to know \LaTeX{} already when migrating to \LyX{}, because you understand all of the machinery going on under the hood.

Program Listings and the \textsf{R} language
\url{http://gregor.gorjanc.googlepages.com/lyx-sweave}


** Formatting Tables \label{sec:Formatting-Tables}

The prettyR package 

The Hmisc package

#+begin_src R :exports both :results output pp 
library(Hmisc)
summary(cbind(Sepal.Length, Sepal.Width) ~ Species, data = iris)
#+end_src

#+results[0b0ddb8f7dfbc5175a5aff3c39c7105f5d778950]:
#+begin_example
cbind(Sepal.Length, Sepal.Width)    N=150
-------+----------+---+------------+-----------+
|       |          |N  |Sepal.Length|Sepal.Width|
-------+----------+---+------------+-----------+
|Species|setosa    | 50|5.006000    |3.428000   |
|       |versicolor| 50|5.936000    |2.770000   |
|       |virginica | 50|6.588000    |2.974000   |
-------+----------+---+------------+-----------+
|Overall|          |150|5.843333    |3.057333   |
-------+----------+---+------------+-----------+
#+end_example

There is a =method= argument to =summary=, which is set to \texttt{method = "response"} by default. There are two other methods for summarizing data: =reverse= and =cross=. See =?summary.formula= or the following document from Frank Harrell for more details \url{http://biostat.mc.vanderbilt.edu/twiki/bin/view/Main/StatReport}.


** Other Formats \label{sec:Other-Formats}

HTML and prettyR
R2HTML

