appendix.html

<div id="outline-container-7-2-2" class="outline-4">
<h4 id="sec-7-2-2">OpenOffice.org and \texttt{odfWeave}</h4>
<div class="outline-text-4" id="text-7-2-2">

<p>OpenOffice.org (OO.o) is an open source desktop productivity suite which mirrors Microsoft\(\circledR\) Office. It is especially nice because it works on all operating systems. OO.o can read most document formats, and in particular, it will read <code>.doc</code> files. The standard OO.o file extension for documents is <code>.odt</code>, which stands for ``open document text''.
</p>
<p>
The <code>odfWeave</code>  package \cite{odfweave} provides a way to generate an <code>.odt</code> file with \(\mathsf{R}\) input and output code formatted correctly and inserted in the correct places, without any additional work. In this way, one does not need to worry about all of the trouble of typesetting \(\mathsf{R}\) output. Another advantage of <code>odfWeave</code> is that it allows you to generate the report dynamically; if the data underlying the report change or are updated, then a few clicks (or commands) will generate a brand new report.
</p>
<p>
One disadvantage is that the source <code>.odt</code>  file is not easy to read, because it is difficult to visually distinguish the noweb parts (where the \(\mathsf{R}\) code is) from the non-noweb parts. This can be fixed by manually changing the font of the noweb sections to, for instance, Courier font, size <code>10pt</code>. But it is extra work. It would be nice if a program would discriminate between the two different sections and automatically typeset the respective parts in their correct fonts. This is one of the advantages to \LyX{}.
</p>
<p>
Another advantage of OO.o is that even after you have generated the outfile, it is fully editable just like any other <code>.odt</code> document. If there are errors or formatting problems, they can be fixed at any time.
</p>
<p>
Here are the basic steps to typeset a statistical report with OO.o.
</p>
<ol>
<li>Write your report as an <code>.odt</code> document in OO.o just as you would any other document. Call this document <code>infile.odt</code>, and make sure that it is saved in your working directory. 
</li>
<li>At the places you would like to insert \(\mathsf{R}\) code in the document, write the code chunks in the following format:
   \texttt{&lt;\textcompwordmark{}&lt;&gt;\textcompwordmark{}&gt;=}~<br/>
   \texttt{x &lt;- rnorm(10)}~<br/>
   \texttt{mean(x)}~<br/>
   \texttt{@}
   or write whatever code you want between the symbols \texttt{&lt;\textcompwordmark{}&lt;&gt;\textcompwordmark{}&gt;=} and \texttt{@}.
</li>
<li>Open \(\mathsf{R}\) and type the following:
</li>
</ol>




<pre class="src src-R">   <span style="color: #008b8b;">library</span>(odfWeave)
   odfWeave(file = <span style="color: #8b2252;">"infile.odt"</span>, dest = <span style="color: #8b2252;">"outfile.odt"</span>)
</pre>

<ol>
<li>The compiled (<code>.odt</code>) file, complete with all of the \(\mathsf{R}\) output automatically inserted in the correct places, will now be the file <code>outfile.odt</code> located in the working directory. Open <code>outfile.odt</code>, examine it, modify it, and repeat if desired. 
</li>
</ol>


<p>
There are all sorts of extra things that you can do. For example, the \(\mathsf{R}\) commands can be suppressed with the tag \texttt{&lt;\textcompwordmark{}&lt;echo = FALSE&gt;\textcompwordmark{}&gt;=}, and the \(\mathsf{R}\) output may be hidden with \texttt{&lt;\textcompwordmark{}&lt;results = hide&gt;\textcompwordmark{}&gt;=}. See the <code>odfWeave</code> package documentation for details.
</p>
</div>

</div>

<div id="outline-container-7-2-3" class="outline-4">
<h4 id="sec-7-2-3">Sweave and \protect\LaTeX{}</h4>
<div class="outline-text-4" id="text-7-2-3">


<p>
This approach is nice because it works for all operating systems. One can quite literally typeset <i>anything</i> with \LaTeX{}. All of this power comes at a price, however. The writer must learn the \LaTeX{} language which is a nontrivial enterprise. Even given the language, if there is a single syntax error, or a single delimeter missing in the entire document, then the whole thing breaks.
</p>
<p>
\LaTeX{} can do anything, but it is relatively difficult to learn  and very grumpy about syntax errors and delimiter matching. There are however programs useful for formatting LaTeX.
</p>
<p>
A disadvantage is that you cannot see the mathematical formulas until you run the whole file with \LaTeX{}.
</p>
<p>
A disadvantage is that figures and tables are relatively difficult.
</p>
<p>
There are programs to make the process easier: AUC\TeX{}.
</p>
<p>
dev.copy2eps, also dev.copy2pdf
</p>
<p>
<a href="http://www.stat.uni-muenchen.de/~leisch/Sweave/">http://www.stat.uni-muenchen.de/~leisch/Sweave/</a>
</p>

</div>

</div>

<div id="outline-container-7-2-4" class="outline-4">
<h4 id="sec-7-2-4">Sweave and \protect\LyX{}</h4>
<div class="outline-text-4" id="text-7-2-4">

<p>This approach is nice because it works for all operating  systems. It gives you everything from the last section and makes it easier to use \LaTeX{}. That being said, it is better to know \LaTeX{} already when migrating to \LyX{}, because you understand all of the machinery going on under the hood.
</p>
<p>
Program Listings and the \(\mathsf{R}\) language
<a href="http://gregor.gorjanc.googlepages.com/lyx-sweave">http://gregor.gorjanc.googlepages.com/lyx-sweave</a>
</p>

</div>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">Formatting Tables</h3>
<div class="outline-text-3" id="text-7-3">


<p>
The prettyR package 
</p>
<p>
The Hmisc package
</p>



<pre class="src src-R"><span style="color: #008b8b;">library</span>(Hmisc)
summary(cbind(Sepal.Length, Sepal.Width) ~ Species, data = iris)
</pre>



<pre class="example">cbind(Sepal.Length, Sepal.Width)    N=150
-------+----------+---+------------+-----------+
|       |          |N  |Sepal.Length|Sepal.Width|
-------+----------+---+------------+-----------+
|Species|setosa    | 50|5.006000    |3.428000   |
|       |versicolor| 50|5.936000    |2.770000   |
|       |virginica | 50|6.588000    |2.974000   |
-------+----------+---+------------+-----------+
|Overall|          |150|5.843333    |3.057333   |
-------+----------+---+------------+-----------+
</pre>


<p>
There is a <code>method</code> argument to <code>summary</code>, which is set to \texttt{method = "response"} by default. There are two other methods for summarizing data: <code>reverse</code> and <code>cross</code>. See <code>?summary.formula</code> or the <a href="http://biostat.mc.vanderbilt.edu/twiki/bin/view/Main/StatReport">following document</a> from Frank Harrell for more details.
</p>
</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">Other Formats</h3>
<div class="outline-text-3" id="text-7-4">


<p>
HTML and prettyR
R2HTML
</p>
</div>
</div>

</div>
