appendix.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Instructions for Instructors</h2>
<div class="outline-text-2" id="text-8">


<p>
\noun{WARNING: this appendix is not applicable until the exercises
have been written.} 
</p>


<p>
Probably this <i>book</i> could more accurately be described as <i>software</i>. The reason is that the document is one big random variable, one observation realized out of millions. It is electronically distributed under the GNU FDL, and ``free'' in both senses: speech and beer.  
</p>
<p>
There are four components to \IPSUR: the Document, the Program used to generate it, the \(\mathsf{R}\) package that holds the Program, and the Ancillaries that accompany it.
</p>
<p>
The majority of the data and exercises have been designed to be randomly generated. Different realizations of this book will have different graphs and exercises throughout. The advantage of this approach is that a teacher, say, can generate a unique version to be used in his/her class. Students can do the exercises and the teacher will have the answers to all of the problems in their own, unique solutions manual. Students may download a different solutions manual online somewhere else, but none of the answers will match the teacher's copy. 
</p>
<p>
Then next semester, the teacher can generate a <i>new</i> book and the problems will be more or less identical, except the numbers will be changed. This means that students from different sections of the same class will not be able to copy from one another quite so easily. The same will be true for similar classes at different institutions. Indeed, as long as the instructor protects his/her <i>key</i> used to generate the book, it will be difficult for students to crack the code. And if they are industrious enough at this level to find a way to (a) download and decipher my version's source code, (b) hack the teacher's password somehow, and (c) generate the teacher's book with all of the answers, then they probably should be testing out of an ``Introduction to Probability and Statistics'' course, anyway. 
</p>
<p>
The book that you are reading was created with a random seed which was set at the beginning. The original seed is 42. You can choose your own seed, and generate a new book with brand new data for the text and exercises, complete with updated manuals. A method I recommend for finding a seed is to look down at your watch at this very moment and record the 6 digit hour, minute, and second (say, 9:52:59am): choose that for a seed
This method already provides for over 43,000 books, without taking military time into account. An alternative would be to go to \(\mathsf{R}\) and type 
</p>


<p>
0.217012941138819
</p>
<p>
Now choose \(  2170129411388188.0 \)as your secret seed&hellip; write it down in a safe place and do not share it with anyone. Next generate the book with your seed using \LyX{}-Sweave or Sweave-\LaTeX{}. You may wish to also generate Student and Instructor Solution Manuals. Guidance regarding this is given below in the How to Use This Document section.
</p>

</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Generating This Document</h3>
<div class="outline-text-3" id="text-8-1">


<p>
You will need three (3) things to generate this document for yourself, in addition to a current \(\mathsf{R}\) distribution which at the time of this writing is \texttt{  R version 2.13.1 (2011-07-08) } :
</p><ol>
<li>a LaTeX distribution,
</li>
<li>Sweave (which comes with \(\mathsf{R}\) automatically), and 
</li>
<li>\LyX (optional, but recommended).
</li>
</ol>


<p>
We will discuss each of these in turn.
</p>
<dl>
<dt>LaTeX:</dt><dd>The distribution used by the present author was \TeX{} Live (\url{<a href="http://www.tug.org/texlive/">http://www.tug.org/texlive/</a>}). There are plenty of other perfectly suitable LaTeX distributions depending on your operating system, one such alternative being <a href="http://miktex.org/">MikTeX</a> for Microsoft Windows. 
</dd>
<dt>Sweave:</dt><dd>If you have \(\mathsf{R}\) installed, then the required Sweave files are already on your system&hellip; somewhere. The only problems that you may have are likely associated with making sure that your LaTeX distribution knows where to find the <code>Sweave.sty</code> file. See the Sweave Homepage (\url{<a href="http://www.statistik.lmu.de/~leisch/Sweave/">http://www.statistik.lmu.de/~leisch/Sweave/</a>}) for guidance on how to get it working on your particular operating system.
</dd>
<dt>LyX:</dt><dd>Strictly speaking, LyX is not needed to generate this document. But this document was written stem to stern with LyX, taking full advantage of all of the bells and whistles that LyX has to offer over plain \LaTeX{} editors. And it's free. See the LyX homepage (\url{<a href="http://www.lyx.org/">http://www.lyx.org/</a>}) for additional information. If you decide to give LyX a try, then you will need to complete some extra steps to coordinate Sweave and LyX with each other. Luckily, Gregor Gorjanc has a website and an \(\mathsf{R}\) News article \cite{Gorjanc2008} to help you do exactly that. See the LyX-Sweave homepage (\url{http://gregor.gorjanc.googlepages.com/lyx-sweave}) for details.
</dd>
</dl>


<p>
An attempt was made to not be extravagant with fonts or packages so that a person would not need the entire <code>CTAN</code> (or <code>CRAN</code>) installed on their personal computer to generate the book. Nevertheless, there are a few extra packages required. These packages are listed in the <code>preamble</code> of <code>IPSUR.Rnw</code>, <code>IPSUR.tex</code>, and <code>IPSUR.lyx</code>.
</p>

</div>

</div>
