appendix.org
** How to Use This Document \label{sec:How-to-Use-Document}

The easiest way to use this document is to install the =IPSUR= package from =CRAN= and be all done. This way would be acceptable if there is another, primary, text being used for the course and \IPSUR\ is only meant to play a supplementary role.

If you plan for \IPSUR\ to serve as the primary text for your course, then it would be wise to generate your own version of the document. You will need the source code for the Program which can be downloaded from =CRAN= or the \IPSUR\ website. Once the source is obtained there are four (4) basic steps to generating your own copy.

1. Randomly select a secret ``seed'' of integers and replace my seed of 42 with your own seed. 
1. Make sure that the \textsf{\textbf{maintext}} branch is turned \textsf{ON} and also make sure that both the \textsf{\textbf{solutions}} branch and the \textsf{\textbf{answers}} branch are turned \textsf{OFF}. Use \LyX{} or your \LaTeX{} editor with Sweave to generate your unique PDF copy of the book and distribute this copy to your students. (See the \LyX{} User's Guide to learn more about branches; the ones referenced above can be found under \textsf{Document \(\triangleright\) Settings \(\triangleright\) Branches}.)
1. Turn the \textsf{\textbf{maintext}} branch \textsf{OFF} and the \textsf{\textbf{solutions}} branch \textsf{ON}. Generate a ``Student Solutions Manual'' which has complete solutions to selected exercises and distribute the PDF to the students. 
1. Leave the \textsf{\textbf{solutions}} branch \textsf{ON} and also turn the \textsf{\textbf{answers}} branch \textsf{ON} and generate an ``Instructor Solutions and Answers Manual'' with full solutions to some of the exercises and just answers to the remaining exercises. Do NOT distribute this to the students -- unless of course you want them to have the answers to all of the problems.  

To make it easier for those people who do not want to use \LyX{} (or for whatever reason cannot get it working), I have included three (3) Sweave files corresponding to the main text, student solutions, and instructor answers, that are included in the \IPSUR\ source package in the \texttt{/tex} subdirectory. In principle it is possible to change the seed and generate the three parts separately with only Sweave and \LaTeX{}. This method is not recommended by me, but is perhaps desirable for some people.

#+latex: \paragraph*{Generating Quizzes and Exams}
- You can copy-paste selected exercises from the text, put them together, and you have a quiz. Since the numbers are randomly generated you do not need to worry about different semesters. And you will have answer keys already for all of your QUIZZES and EXAMS, too. 

** Ancillary Materials \label{sec:Ancillary-Materials}
In addition to the main text, student manual, and instructor manual, there are two other ancillaries. IPSUR.R, and IPSUR.RData.

** Modifying This Document \label{sec:Modifying-This-Document}
Since this document is released under the GNU-FDL, you are free to modify this document however you wish (in accordance with the license -- see Appendix \ref{cha:GNU-Free-Documentation}). The immediate benefit of this is that you can generate the book, with brand new problem sets, and distribute it to your students simply as a PDF (in an email, for instance). As long as you distribute less than 100 such /Opaque/ copies, you are not even required by the GNU-FDL to share your /Transparent/ copy (the source code with the secret key) that you used to generate them. Next semester, choose a new key and generate a new copy to be distributed to the new class. 

#+begin_quote
But more generally, if you are not keen on the way I explained (or failed to explain) something, then you are _free_ to rewrite it. If you would like to cover more (or less) material, then you are _free_ to add (or delete) whatever Chapters/Sections/Paragraphs that you wish. And since you have the source code, you do not need to retype the wheel. 
#+end_quote

Some individuals will argue that the nature of a statistics textbook like this one, many of the exercises being randomly generated /by design/, does a disservice to the students because the exercises do not use real-world data. That is a valid criticism... but in my case the benefits outweighed the detriments and I moved forward to incorporate static data sets whenever it was feasible and effective. Frankly, and most humbly, the only response I have for those individuals is: ``Please refer to the preceding paragraph.''

* =RcmdrTestDrive= Story
\label{cha:RcmdrTestDrive-Story}

The goal of =RcmdrTestDrive= was to have a data set sufficiently rich in the types of data represented such that a person could load it into the \textsf{R} Commander and be able to explore all of =Rcmdr='s menu options at once. I decided early-on that an efficient way to do this would be to generate the data set randomly, and later add to the list of variables as more =Rcmdr= menu options became available. Generating the data was easy, but generating a story that related all of the respective variables proved to be less so.

In the Summer of 2006 I gave a version of the raw data and variable names to my STAT 3743 Probability and Statistics class and invited each of them to write a short story linking all of the variables together in a coherent narrative. No further direction was given. 

The most colorful of those I received was written by Jeffery Cornfield, submitted July 12, 2006, and is included below with his permission. It was edited slightly by the present author and updated to respond dynamically to the random generation of =RcmdrTestDrive=; otherwise, the story has been unchanged. 

