appendix.html

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2">How to Use This Document</h3>
<div class="outline-text-3" id="text-8-2">


<p>
The easiest way to use this document is to install the <code>IPSUR</code> package from <code>CRAN</code> and be all done. This way would be acceptable if there is another, primary, text being used for the course and \IPSUR\ is only meant to play a supplementary role.
</p>
<p>
If you plan for \IPSUR\ to serve as the primary text for your course, then it would be wise to generate your own version of the document. You will need the source code for the Program which can be downloaded from <code>CRAN</code> or the \IPSUR\ website. Once the source is obtained there are four (4) basic steps to generating your own copy.
</p>
<ol>
<li>Randomly select a secret ``seed'' of integers and replace my seed of 42 with your own seed. 
</li>
<li>Make sure that the <code>maintext</code> branch is turned <code>ON</code> and also make sure that both the <code>solutions</code> branch and the <code>answers</code> branch are turned <code>OFF</code>. Use LyX or your LaTeX editor with Sweave to generate your unique PDF copy of the book and distribute this copy to your students. (See the LyX User's Guide to learn more about branches; the ones referenced above can be found under <code>Document</code> \(\triangleright\) <code>Settings</code> \(\triangleright\) <code>Branches</code>.)
</li>
<li>Turn the <code>maintext</code> branch <code>OFF</code> and the <code>solutions</code> branch <code>ON</code>. Generate a ``Student Solutions Manual'' which has complete solutions to selected exercises and distribute the PDF to the students. 
</li>
<li>Leave the <code>solutions</code> branch <code>ON</code> and also turn the <code>answers</code> branch <code>ON</code> and generate an ``Instructor Solutions and Answers Manual'' with full solutions to some of the exercises and just answers to the remaining exercises. Do NOT distribute this to the students &ndash; unless of course you want them to have the answers to all of the problems.  
</li>
</ol>


<p>
To make it easier for those people who do not want to use LyX (or for whatever reason cannot get it working), I have included three (3) Sweave files corresponding to the main text, student solutions, and instructor answers, that are included in the \IPSUR\ source package in the <code>/tex</code> subdirectory. In principle it is possible to change the seed and generate the three parts separately with only Sweave and LaTeX. This method is not recommended by me, but is perhaps desirable for some people.
</p>
<ul>
<li>You can copy-paste selected exercises from the text, put them together, and you have a quiz. Since the numbers are randomly generated you do not need to worry about different semesters. And you will have answer keys already for all of your QUIZZES and EXAMS, too. 
</li>
</ul>


</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3">Ancillary Materials</h3>
<div class="outline-text-3" id="text-8-3">

<p>In addition to the main text, student manual, and instructor manual, there are two other ancillaries. IPSUR.R, and IPSUR.RData.
</p>
</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4">Modifying This Document</h3>
<div class="outline-text-3" id="text-8-4">

<p>Since this document is released under the GNU-FDL, you are free to modify this document however you wish (in accordance with the license &ndash; see Appendix <a href="#cha-GNU-Free-Documentation">GNU-Free-Documentation</a>). The immediate benefit of this is that you can generate the book, with brand new problem sets, and distribute it to your students simply as a PDF (in an email, for instance). As long as you distribute less than 100 such <i>Opaque</i> copies, you are not even required by the GNU-FDL to share your <i>Transparent</i> copy (the source code with the secret key) that you used to generate them. Next semester, choose a new key and generate a new copy to be distributed to the new class. 
</p>
<blockquote>

<p>But more generally, if you are not keen on the way I explained (or failed to explain) something, then you are <span style="text-decoration:underline;">free</span> to rewrite it. If you would like to cover more (or less) material, then you are <span style="text-decoration:underline;">free</span> to add (or delete) whatever Chapters/Sections/Paragraphs that you wish. And since you have the source code, you do not need to retype the wheel. 
</p>
</blockquote>


<p>
Some individuals will argue that the nature of a statistics textbook like this one, many of the exercises being randomly generated <i>by design</i>, does a disservice to the students because the exercises do not use real-world data. That is a valid criticism&hellip; but in my case the benefits outweighed the detriments and I moved forward to incorporate static data sets whenever it was feasible and effective. Frankly, and most humbly, the only response I have for those individuals is: ``Please refer to the preceding paragraph.''
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><code>RcmdrTestDrive</code> Story</h2>
<div class="outline-text-2" id="text-9">


<p>
The goal of <code>RcmdrTestDrive</code> was to have a data set sufficiently rich in the types of data represented such that a person could load it into the \(\mathsf{R}\) Commander and be able to explore all of <code>Rcmdr</code>'s menu options at once. I decided early-on that an efficient way to do this would be to generate the data set randomly, and later add to the list of variables as more <code>Rcmdr</code> menu options became available. Generating the data was easy, but generating a story that related all of the respective variables proved to be less so.
</p>
<p>
In the Summer of 2006 I gave a version of the raw data and variable names to my STAT 3743 Probability and Statistics class and invited each of them to write a short story linking all of the variables together in a coherent narrative. No further direction was given. 
</p>
<p>
The most colorful of those I received was written by Jeffery Cornfield, submitted July 12, 2006, and is included below with his permission. It was edited slightly by the present author and updated to respond dynamically to the random generation of <code>RcmdrTestDrive</code>; otherwise, the story has been unchanged. 
</p>

</div>
